[
  {
    "CaseID": "Emergency_1",
    "case": "A 26-year-old man presented to the emergency room complaining of sudden left sided chest pain for few hours. Clinical examination revealed contralateral tracheal shift and hyperresonance with absent breathing sound over the left lung. What is the most likely diagnosis? [10/2021T_2/2023S]",
    "options": [
      "Left pneumonia",
      "Left pulmonary infarction",
      "Angina pectoris",
      "Acute myocardial infarction",
      "Left pneumothorax"
    ],
    "correctAnswer": "Left pneumothorax",
    "explanation": {
      "correct": "Sudden unilateral chest pain with absent breath sounds, hyperresonance, and contralateral tracheal shift indicates tension pneumothorax on the left side due to accumulation of air under pressure in the pleural cavity.",
      "incorrect": [
        {"option": "Left pneumonia", "reason": "Would cause dullness to percussion, bronchial breathing, and crepitations — not hyperresonance."},
        {"option": "Left pulmonary infarction", "reason": "Usually secondary to pulmonary embolism and presents with hemoptysis, pleuritic pain, but not tracheal deviation or hyperresonance."},
        {"option": "Angina pectoris", "reason": "Causes central chest pain without respiratory findings or tracheal deviation."},
        {"option": "Acute myocardial infarction", "reason": "Characterized by substernal pain and ECG changes, not unilateral absent breath sounds."}
      ]
    }
  },
  {
    "CaseID": "Emergency_2",
    "case": "A 52-year-old woman comes to the emergency department because of a 3-week history of shortness of breath and nonproductive cough. The shortness of breath has progressively worsened during the past 2 days. She also has a 3-week history of low back mild pain. Ibuprofen has provided minimal relief of her pain. She began smoking at age 32 and has smoked one pack of cigarettes daily. Her temperature is 37.0°C, pulse is 105/min, respirations are 26/min, and blood pressure is 180/118 mm Hg. Pulse oximetry on room air shows an oxygen saturation of 88 %. Physical examination shows jugular venous distention to 3cm above the sternal angle. Auscultation of the lungs discloses bilateral wheezing and basilar crackles. Cardiac examination discloses an S3. There is bilateral edema of the lower extremities. Chest X-ray shows cardiomegaly, bilateral infiltrates, and bilateral pleural effusions at the lung base. Which of the following is the most likely diagnosis? [10/2021T_11/2022R_6/2023R]",
    "options": [
      "Right-sided heart failure",
      "Asthma",
      "Pneumonia",
      "Chronic obstructive pulmonary disease",
      "Myocarditis"
    ],
    "correctAnswer": "Myocarditis",
    "explanation": {
      "correct": "The presentation of progressive dyspnea, S3 gallop, pulmonary congestion, and cardiomegaly with bilateral pleural effusions suggests acute myocarditis causing biventricular heart failure. Often follows viral infection and can mimic decompensated heart failure.",
      "incorrect": [
        {"option": "Right-sided heart failure", "reason": "Would present mainly with peripheral edema, ascites, and JVP elevation but without pulmonary edema or S3."},
        {"option": "Asthma", "reason": "Causes wheezing but not S3, JVP elevation, or cardiomegaly."},
        {"option": "Pneumonia", "reason": "Would show focal infiltrate, fever, and productive cough — not diffuse cardiomegaly or pleural effusions."},
        {"option": "Chronic obstructive pulmonary disease", "reason": "May cause dyspnea and wheeze, but not acute S3 gallop or bilateral pleural effusions."}
      ]
    }
  },
  {
    "CaseID": "Emergency_3",
    "case": "A 25-year-old woman is brought to the Emergency Department following a road traffic car accident. On arrival her blood pressure is 110/50 mmHg, heart rate 92/min and respiratory rate 28/min. On examination there is decreased air entry on the right side as well as dullness on percussion and fracture of 2 ribs. Which one of the following is immediate treatment of the patient’s condition? [10/2021T_11/2022R_6/2023R_11/2023S_11/2023R_2/2024T_8/2024T]",
    "options": [
      "Strapping the complete chest",
      "Analgesia-sedatives",
      "Endotracheal intubation and ventilation",
      "Insertion of chest drain underwater seal",
      "CPAP"
    ],
    "correctAnswer": "Insertion of chest drain underwater seal",
    "explanation": {
      "correct": "The patient has hemothorax — dullness to percussion, decreased air entry, and rib fracture indicate blood in the pleural cavity. The immediate management is insertion of a chest tube with underwater seal drainage to evacuate blood and re-expand the lung.",
      "incorrect": [
        {"option": "Strapping the complete chest", "reason": "Restricts ventilation and increases hypoxia risk."},
        {"option": "Analgesia-sedatives", "reason": "Supportive only; does not treat the underlying hemothorax."},
        {"option": "Endotracheal intubation and ventilation", "reason": "Only indicated if respiratory failure develops — not the initial step."},
        {"option": "CPAP", "reason": "Contraindicated in thoracic trauma with possible pneumothorax/hemothorax."}
      ]
    }
  },
  {
    "CaseID": "Emergency_4",
    "case": "A 6-year-old boy is brought to the emergency room with a 3-hour history of fever 39.5°C and sore throat. The child appears anxious and toxic. He has mild inspiratory stridor and he is drooling. He is sitting on the examination table leaning forward with his neck extended. Which of the following is the most appropriate immediate management of the patient? [2/2023T_2/2023R_6/2023S_6/2023R]",
    "options": [
      "Admit the child and place him in a mist tent",
      "Examine the throat and obtain a culture",
      "Obtain an arterial blood gas and start an IV line",
      "Prepare to establish an airway",
      "Examine under anesthesia"
    ],
    "correctAnswer": "Prepare to establish an airway",
    "explanation": {
      "correct": "The clinical picture of high fever, drooling, tripod position, and inspiratory stridor is classic for acute epiglottitis — a life-threatening airway obstruction. The priority is immediate airway management by expert (endotracheal intubation or tracheostomy).",
      "incorrect": [
        {"option": "Admit the child and place him in a mist tent", "reason": "Delays definitive airway; mist tent is for mild croup, not epiglottitis."},
        {"option": "Examine the throat and obtain a culture", "reason": "Can trigger laryngospasm and complete airway obstruction."},
        {"option": "Obtain an arterial blood gas and start an IV line", "reason": "Secondary to airway stabilization; not initial."},
        {"option": "Examine under anesthesia", "reason": "Only after airway is secured; doing so before is dangerous."}
      ]
    }
  },
  {
    "CaseID": "Emergency_5",
    "case": "A 31-year-old man is brought to the emergency room following a motor car accident in which his chest struck the steering wheel. Examination reveals stable vital signs, but the patient exhibits multiple palpable rib fractures and paradoxical movement of the right side of the chest. Chest X-ray shows no evidence of pneumo- or hemothorax but a large pulmonary contusion is developing. What is the proper management for this case? [1/2023M_2/2023T_2/2023R_6/2023S_6/2023R_11/2023S_11/2023R_8/2024T-8/2024R]",
    "options": [
      "Stabilization of the chest wall with sandbags",
      "Immediate operative stabilization",
      "Stabilization with towel clips",
      "Tracheostomy, mechanical ventilation and positive end-expiratory pressure",
      "None of the above"
    ],
    "correctAnswer": "Tracheostomy, mechanical ventilation and positive end-expiratory pressure",
    "explanation": {
      "correct": "Paradoxical chest movement indicates flail chest with underlying pulmonary contusion. The definitive management is airway protection and mechanical ventilation with positive end-expiratory pressure (PEEP) to stabilize the flail segment internally.",
      "incorrect": [
        {"option": "Stabilization of the chest wall with sandbags", "reason": "Temporary measure only; not adequate for pulmonary contusion."},
        {"option": "Immediate operative stabilization", "reason": "Rarely required unless chest wall defect is massive."},
        {"option": "Stabilization with towel clips", "reason": "Obsolete and inadequate."},
        {"option": "None of the above", "reason": "Incorrect because mechanical ventilation is the standard of care."}
      ]
    }
  },
  {
    "CaseID": "Emergency_6",
    "case": "A 52-year-old woman comes to the emergency department because of a 3-week history of shortness of breath and nonproductive cough. The shortness of breath has progressively worsened during the past 2 days. She also has a 3-week history of low back mild pain. Ibuprofen has provided minimal relief of her pain. She has no history of serious illness and takes no routine medications. She began smoking at age 32 and smoked one pack of cigarettes daily. Her temperature is 37.0°C (98.6 F), pulse is 105/min, respirations are 26/min, and blood pressure is 180/118 mm Hg. Pulse oximetry on room air shows an oxygen saturation of 88%. Physical examination shows jugular venous distention to 3 cm above the sternal angle. Auscultation of the lungs discloses bilateral wheezing and basilar crackles. Cardiac examination discloses an S3. There is bilateral edema of the lower extremities. Chest x-ray shows cardiomegaly, bilateral infiltrates, and bilateral pleural effusions at the lung base. Which of the following is the most appropriate initial pharmacotherapy? [10/2021T_11/2022R_6/2023R]",
    "options": [
      "Oral carvedilol",
      "Intravenous chlorothiazide",
      "Intravenous digoxin",
      "Intravenous furosemide",
      "Intravenous dobutamine"
    ],
    "correctAnswer": "Intravenous furosemide",
    "explanation": {
      "correct": "The patient has acute decompensated left-sided heart failure with pulmonary edema. The first-line treatment is IV furosemide to reduce preload and pulmonary congestion rapidly.",
      "incorrect": [
        {"option": "Oral carvedilol", "reason": "Beta blockers are contraindicated in acute decompensated heart failure; only used chronically when stable."},
        {"option": "Intravenous chlorothiazide", "reason": "Less effective than loop diuretics for acute pulmonary edema."},
        {"option": "Intravenous digoxin", "reason": "Acts slowly; used in chronic heart failure with atrial fibrillation."},
        {"option": "Intravenous dobutamine", "reason": "Used when there is cardiogenic shock with poor perfusion, not isolated pulmonary edema."}
      ]
    }
  },
  {
    "CaseID": "Emergency_7",
    "case": "A 39-year-old motorcyclist presents following a road traffic collision. He arrives at the Emergency Department with a pelvic splint in place. He is assessed with a primary survey, which discovers a likely pelvic fracture. He is tachycardic at 115 beats/min despite giving an immediate 2L of Hartmann’s solution. He is hypotensive on reassessment. What is the most appropriate management option? [11/2020T_12/2020T_1/2021T_11/2022R]",
    "options": [
      "Internal iliac artery embolization",
      "Laparotomy",
      "CT head",
      "Chest drain",
      "CT neck"
    ],
    "correctAnswer": "Internal iliac artery embolization",
    "explanation": {
      "correct": "Persistent hypotension after adequate fluid resuscitation in pelvic fracture indicates ongoing arterial bleeding. Selective internal iliac artery embolization is the best management to control pelvic hemorrhage.",
      "incorrect": [
        {"option": "Laparotomy", "reason": "Not indicated unless there is evidence of intraperitoneal bleeding."},
        {"option": "CT head", "reason": "Does not address hemodynamic instability."},
        {"option": "Chest drain", "reason": "No signs of thoracic injury."},
        {"option": "CT neck", "reason": "Irrelevant to the source of bleeding."}
      ]
    }
  },
  {
    "CaseID": "Emergency_8",
    "case": "A 45-year-old woman presents to the emergency room with abdominal pain and vomiting for 2 days. She is passing flatus but has not passed stools since yesterday. On examination the abdomen is tender with marked distension. There is a tender swelling above the umbilicus which is crescentic in shape. The swelling is irreducible, dark in color and does not give an impulse on coughing. The pulse rate is 108 bpm, blood pressure 90/50 and temperature is 38.0°C. What is the immediate management? [1/2023M_2/2023T_2/2023R_6/2023S_6/2023R_11/2023S_2/2024S_8/2024T_8/2024R]",
    "options": [
      "Preoperative detailed investigations to detect the cause.",
      "Early fluid resuscitation.",
      "Surgical interference.",
      "Proper examination of content.",
      "Resection of devitalized parts"
    ],
    "correctAnswer": "Surgical interference.",
    "explanation": {
      "correct": "The case is a strangulated paraumbilical hernia with obstruction and ischemia. Immediate surgical intervention is mandatory to release strangulation and resect devitalized bowel if needed.",
      "incorrect": [
        {"option": "Preoperative detailed investigations to detect the cause.", "reason": "Delays life-saving surgery in strangulation."},
        {"option": "Early fluid resuscitation.", "reason": "Important supportive step but not definitive management."},
        {"option": "Proper examination of content.", "reason": "Not possible without surgery."},
        {"option": "Resection of devitalized parts", "reason": "May be part of surgery but not the immediate overall management step."}
      ]
    }
  },
  {
    "CaseID": "Emergency_9",
    "case": "A fully heparinized patient develops a condition requiring emergency surgery. After stopping the heparin, what else should be done to prepare the patient? [11/2022R_1/2023M_2/2023T_2/2023R_6/2023S-6/2023R_2/2024S_8/2024R]",
    "options": [
      "Immediate administration of protamine 5 mg for every 100 units of heparin most recently administered.",
      "Vit. K intramuscular injection",
      "Nothing, if the surgery can be delayed for 2-3 hours.",
      "Transfusion of 10 units of platelets.",
      "Immediate fresh frozen plasma"
    ],
    "correctAnswer": "Immediate administration of protamine 5 mg for every 100 units of heparin most recently administered.",
    "explanation": {
      "correct": "Protamine sulfate neutralizes the anticoagulant effect of heparin rapidly and is the specific antidote before emergency surgery.",
      "incorrect": [
        {"option": "Vit. K intramuscular injection", "reason": "Reverses warfarin, not heparin."},
        {"option": "Nothing, if the surgery can be delayed for 2-3 hours.", "reason": "Heparin effect persists for several hours; neutralization is safer."},
        {"option": "Transfusion of 10 units of platelets.", "reason": "Platelet transfusion does not reverse heparin effect."},
        {"option": "Immediate fresh frozen plasma", "reason": "Used for factor deficiency or warfarin reversal, not heparin."}
      ]
    }
  },
  {
    "CaseID": "Emergency_10",
    "case": "A 75-year-old male patient is brought to emergency room with sudden inability to pass urine. The patient gave history of frequency & micturition over the last few years which makes him wake up 2-3 times/night. Abdominal examination showed supra-pubic swelling. What is the diagnosis of this condition? [1/2023M_2/2023T_2/2023R_6/2023S_6/2023R-11/2023S_8/2024T_8/2024R]",
    "options": [
      "Benign prostatic hyperplasia",
      "Cancer prostate",
      "Pyelonephritis",
      "Traumatic urethral tear",
      "Urethral stricture"
    ],
    "correctAnswer": "Benign prostatic hyperplasia",
    "explanation": {
      "correct": "An elderly man with gradual lower urinary tract symptoms (frequency, nocturia) and acute urinary retention with palpable bladder suggests BPH causing bladder outlet obstruction.",
      "incorrect": [
        {"option": "Cancer prostate", "reason": "Usually presents with weight loss, bone pain, and hard irregular prostate, not acute retention alone."},
        {"option": "Pyelonephritis", "reason": "Associated with fever, flank pain, and dysuria, not palpable bladder."},
        {"option": "Traumatic urethral tear", "reason": "Would present after pelvic trauma with blood at meatus."},
        {"option": "Urethral stricture", "reason": "More common in young males post-infection, presents with poor stream but not acute retention."}
      ]
    }
  },
  {
    "CaseID": "Emergency_11",
    "case": "A 70-year-old man has been brought as an emergency complaining of sudden onset of severe left sided abdominal pain radiating to the back. He has a systolic blood pressure of 70 mmHg, pulse rate of 120 per minute and is cold and clammy with a tender distended abdomen and a pulsatile mass, which of the following is the appropriate diagnosis? [2/2023S]",
    "options": [
      "Abdominal compartment syndrome (ACS)",
      "Acute femoro occipital embolus",
      "Aorto caval fistula",
      "Aorto iliac occlusion",
      "Ruptured aortic aneurysm"
    ],
    "correctAnswer": "Ruptured aortic aneurysm",
    "explanation": {
      "correct": "Elderly man with hypotension, back pain, and pulsatile abdominal mass = classic triad for ruptured abdominal aortic aneurysm (AAA), a surgical emergency.",
      "incorrect": [
        {"option": "Abdominal compartment syndrome (ACS)", "reason": "Occurs postoperatively with raised intraabdominal pressure, not sudden collapse."},
        {"option": "Acute femoro occipital embolus", "reason": "Unrelated term; emboli cause limb ischemia not abdominal mass."},
        {"option": "Aorto caval fistula", "reason": "Presents with continuous bruit and high-output heart failure, not shock."},
        {"option": "Aorto iliac occlusion", "reason": "Causes lower limb ischemia, not abdominal distension or hypotension."}
      ]
    }
  },
  {
    "CaseID": "Emergency_12",
    "case": "An 11-month-old boy is brought to the Emergency Department with 6 episodes of diarrhea and 4 episodes of vomiting daily for the past 2 days. On examination, he has a dry mouth, sunken eyes, and depressed fontanelle. What is the most important initial management step? [1/2023M_6/2023R_11/2023T_11/2023S_2/2024T_2/2024S_8/2024T_8/2024S]",
    "options": [
      "Send home advising the mother for giving excess fluids",
      "Insert IV line and correct dehydration",
      "Give parenteral antiemetic",
      "Insert nasogastric tube for feeding",
      "Give antidiarrheal medication"
    ],
    "correctAnswer": "Insert IV line and correct dehydration",
    "explanation": {
      "correct": "Signs of moderate to severe dehydration (sunken eyes, depressed fontanelle) require IV rehydration to restore fluid and electrolyte balance promptly.",
      "incorrect": [
        {"option": "Send home advising the mother for giving excess fluids", "reason": "Appropriate only for mild dehydration."},
        {"option": "Give parenteral antiemetic", "reason": "Does not correct dehydration."},
        {"option": "Insert nasogastric tube for feeding", "reason": "Not indicated during acute dehydration management."},
        {"option": "Give antidiarrheal medication", "reason": "Contraindicated in children due to risk of ileus and toxicity."}
      ]
    }
  },
  {
    "CaseID": "Emergency_13",
    "case": "An 18-month-old male is brought to the Emergency Department with diarrhea and vomiting for 2 days. He has about 6 episodes of diarrhea and 4 episodes of vomiting per day and is not feeding well. His mother states that his activity level is decreased, is always weak and tired and has a decreased number of wet diapers. What is the most important initial management step? [2/2021R_10/2021T_11/2022R_1/2023M_11/2023T_11/2023S-2/2024T_2/2024S_8/2024T]",
    "options": [
      "Give parenteral antiemetic",
      "Insert IV line to correct dehydration",
      "Give antidiarrheal medication",
      "Send home advising the mother to give excess fluids",
      "Insert nasogastric tube for feeding"
    ],
    "correctAnswer": "Insert IV line to correct dehydration",
    "explanation": {
      "correct": "The child has moderate to severe dehydration as evidenced by lethargy, dry mucosa, and oliguria — IV fluid therapy with isotonic solution is essential.",
      "incorrect": [
        {"option": "Give parenteral antiemetic", "reason": "Symptomatic only; does not replace fluids."},
        {"option": "Give antidiarrheal medication", "reason": "Contraindicated in infants."},
        {"option": "Send home advising the mother to give excess fluids", "reason": "Unsafe for moderate dehydration."},
        {"option": "Insert nasogastric tube for feeding", "reason": "Feeding withheld until rehydration achieved."}
      ]
    }
  },
  {
    "CaseID": "Emergency_14",
    "case": "A nine-month-old infant was brought to the Emergency Department with repeated attacks of watery diarrhea for the past 24 hours. On examination, he has slow skin pinch, mildly sunken eyes, irritability and his abdomen is lax and not distended. Which of the following is the most appropriate management step? [2/2021R_1/2021R_1/2023M_11/2023T_11/2023S-2/2024T_2/2024S_8/2024T_8/2024S]",
    "options": [
      "Start oral rehydration therapy",
      "IV correction of dehydration",
      "Order electrolytes and kidney functions",
      "Ryle tube administration of oral hydration solution",
      "Stop diarrhea"
    ],
    "correctAnswer": "Start oral rehydration therapy",
    "explanation": {
      "correct": "The infant has mild dehydration (slow skin pinch, mild irritability). The best treatment is oral rehydration therapy (ORT) using WHO oral solution to prevent worsening.",
      "incorrect": [
        {"option": "IV correction of dehydration", "reason": "Reserved for severe dehydration or shock."},
        {"option": "Order electrolytes and kidney functions", "reason": "Not urgent before rehydration in mild cases."},
        {"option": "Ryle tube administration of oral hydration solution", "reason": "Used only if oral intake not tolerated."},
        {"option": "Stop diarrhea", "reason": "Antidiarrheal drugs are contraindicated in infants."}
      ]
    }
  },
  {
    "CaseID": "Emergency_15",
    "case": "A ten months old boy suddenly develops fever 40.1°C and is rushed by his parents to the Emergency Room. As soon as he arrives, he starts to convulse with tonic clonic fits. Respiratory rate 40/min, heart rate 110/min. Which is the most appropriate initial management step? [10/2021T_11/2022R_1/2023M_2/2023T_2/2023R_5/2023M_6/2023S_6/2023R]",
    "options": [
      "IV fluids and IV diazepam",
      "IV antibiotics and IV diazepam",
      "Ensure patent airway and IV diazepam",
      "Rectal diazepam",
      "Paracetamol suppositories"
    ],
    "correctAnswer": "Ensure patent airway and IV diazepam",
    "explanation": {
      "correct": "Febrile seizure management starts with maintaining airway, breathing, and circulation, followed by administration of IV diazepam to terminate convulsions.",
      "incorrect": [
        {"option": "IV fluids and IV diazepam", "reason": "Fluids are supportive but airway takes priority."},
        {"option": "IV antibiotics and IV diazepam", "reason": "Antibiotics are for infection later, not initial seizure control."},
        {"option": "Rectal diazepam", "reason": "Used if IV access unavailable; airway still the first priority."},
        {"option": "Paracetamol suppositories", "reason": "Lowers fever but does not stop seizure."}
      ]
    }
  },
  {
    "CaseID": "Emergency_16",
    "case": "A severely traumatized woman is seen in the emergency room with a Glasgow coma scale of 5T. Her family asks what the significance of this measurement is. Which of the following statements you will say it to the family regarding the Glasgow coma scales of this patient? [10/2021T_11/2021R_6/2023R_2/2024T]",
    "options": [
      "It includes measurement of intracranial pressure (ICP).",
      "A high score correlates with a high mortality rate",
      "It includes measurement of verbal response, motor response and eye opening.",
      "It serves to assess the long-term sequelae of head trauma.",
      "It includes measurement of pupillary reflexes."
    ],
    "correctAnswer": "It includes measurement of verbal response, motor response and eye opening.",
    "explanation": {
      "correct": "The Glasgow Coma Scale (GCS) assesses three domains only: eye opening, verbal response, and motor response. A score of 5T indicates severe impairment with a recorded \"T\" for intubation (verbal not testable).",
      "incorrect": [
        {"option": "It includes measurement of intracranial pressure (ICP).", "reason": "ICP is not part of GCS; it requires invasive monitoring and is a separate parameter."},
        {"option": "A high score correlates with a high mortality rate", "reason": "The opposite: higher GCS = better prognosis; lower GCS correlates with higher mortality."},
        {"option": "It serves to assess the long-term sequelae of head trauma.", "reason": "GCS reflects current level of consciousness, not long-term outcomes."},
        {"option": "It includes measurement of pupillary reflexes.", "reason": "Pupillary responses are part of neurologic exam but not included in GCS scoring."}
      ]
    }
  },
  {
    "CaseID": "Emergency_17",
    "case": "A 75-year-old woman comes to the emergency department because of a 8-hour history of left-sided abdominal pain. This morning 2 hours ago, she passed stool with dark-colored blood clots. She has type 2 diabetes mellitus and hypertension treated with ACE inhibitors. She has no history of gastrointestinal illness. Her temperature is 38.1°C (100.6°F), pulse is 120/min, respirations are 18/min, and blood pressure is 110/85 mm Hg. Abdominal examination discloses tenderness (pain) to palpation along the descending colon. Laboratory studies show: CT scan of the abdomen with contrast shows no free air. Which of the following is most likely to confirm the suspected diagnosis? [10/2021T_6/2023R]",
    "options": [
      "Barium enema",
      "CT scan of the abdomen with contrast",
      "Abdominal ultrasound",
      "MRI of the abdomen",
      "Colonoscopy"
    ],
    "correctAnswer": "Colonoscopy",
    "explanation": {
      "correct": "Elderly patient with acute left-sided abdominal pain, fever, hematochezia, and descending colon tenderness is suspicious for ischemic colitis. Colonoscopy confirms the diagnosis by direct visualization of mucosal ischemia and allows biopsy if needed.",
      "incorrect": [
        {"option": "Barium enema", "reason": "Contraindicated in suspected colitis/ischemia due to risk of perforation and poor yield acutely."},
        {"option": "CT scan of the abdomen with contrast", "reason": "Useful for suggesting ischemia or complications, but colonoscopy is the confirmatory test."},
        {"option": "Abdominal ultrasound", "reason": "Low sensitivity for colonic mucosal ischemia."},
        {"option": "MRI of the abdomen", "reason": "Not first-line and rarely needed to confirm ischemic colitis."}
      ]
    }
  },
  {
    "CaseID": "Emergency_18",
    "case": "A 65-year-old female patient is admitted to the emergency department with a short history of fresh blood per rectum, and long history of altered bowel habits. The patient is pale, blood pressure: 140/85, Pulse: 75/min. There are residual stains of blood on rectal examination. Her bowel is opened with no new attacks of bleeding. What is the next immediate step for management? [10/2021T_6/2023R_2/2024S]",
    "options": [
      "Abdominal ultrasonography",
      "Oesophago-gastro-duodenoscopy",
      "Mesenteric CT angiography.",
      "Colonoscopy",
      "Abdominal plain X"
    ],
    "correctAnswer": "Colonoscopy",
    "explanation": {
      "correct": "In a hemodynamically stable patient with lower GI bleeding and history suggesting colonic pathology, colonoscopy is the next step to localize the bleeding source and evaluate for neoplasia or colitis.",
      "incorrect": [
        {"option": "Abdominal ultrasonography", "reason": "Poor at localizing colonic bleeding or mucosal lesions."},
        {"option": "Oesophago-gastro-duodenoscopy", "reason": "Evaluates upper GI tract; presentation indicates a lower source."},
        {"option": "Mesenteric CT angiography.", "reason": "Most useful in brisk ongoing bleeding; here bleeding has subsided and the patient is stable."},
        {"option": "Abdominal plain X", "reason": "Limited diagnostic value for lower GI bleeding."}
      ]
    }
  },
  {
    "CaseID": "Emergency_19",
    "case": "A 60-year-old woman comes to the emergency department 2 hours after she vomited coffee ground-like material. She has no history of similar symptoms. She has osteoarthritis of both hips and hypertension. She is on daily non-steroidal, anti-inflammatory tablet and Enalapril tablet. She started smoking at age 30 and has smoked one pack of cigarettes daily She drinks one glasses of wine once a week. She is 160 cm tall and weighs 85 kg. Her temperature is 36.9°C, pulse is 110/min, respirations are 20/min, and blood pressure is 120/70 mm Hg. Physical examination shows no other abnormalities. Nasogastric aspiration yields 200 ml of coffee-ground material. A 0.9% saline stomach lavage cleared the aspirate. Which of the following is the most appropriate next step in diagnosis? [10/2021T_6/2023R]",
    "options": [
      "CT scan of the abdomen",
      "ultrasonography of the abdomen",
      "upper gastrointestinal endoscopy",
      "esophageal Manometry",
      "angiography of the celiac axis"
    ],
    "correctAnswer": "upper gastrointestinal endoscopy",
    "explanation": {
      "correct": "Coffee-ground emesis indicates upper GI bleeding that has slowed; the diagnostic test of choice is urgent upper endoscopy to identify and potentially treat the source (e.g., NSAID-related peptic ulcer).",
      "incorrect": [
        {"option": "CT scan of the abdomen", "reason": "Not useful for mucosal bleeding source localization in the upper GI tract."},
        {"option": "ultrasonography of the abdomen", "reason": "Does not evaluate the esophagus/stomach mucosa."},
        {"option": "esophageal Manometry", "reason": "Assesses motility disorders, not bleeding."},
        {"option": "angiography of the celiac axis", "reason": "Reserved for active brisk bleeding when endoscopy fails or is not feasible."}
      ]
    }
  },
  {
    "CaseID": "Emergency_20",
    "case": "44-year-old woman comes to the emergency department because of a - day history of severe pain in her upper abdomen that radiates to her back, nausea, and vomiting. She has had 3 episodes of emesis during this time. She has no history of serious illness and takes no medications. She does not smoke cigarettes. Her temperature is 37.0°C (98.6°F), pulse is 11/min, respirations are 22/min and shallow, and blood pressure is 118/72 mm Hg. Pulse oximetry on room air shows an oxygen saturation of 97%. The abdomen is soft and mildly distended. There is severe right upper quadrant and epigastric tenderness (pain) to palpation. No organomegaly is noted. Which of the following is most likely to confirm the suspected diagnosis? [10/2021T_11/2022R_6/2023R]",
    "options": [
      "Liver isotope scan",
      "CT scan of the abdomen with contrast",
      "Ultrasonography of the abdomen",
      "Upper gastrointestinal endoscopy",
      "Transesophageal echocardiography"
    ],
    "correctAnswer": "Ultrasonography of the abdomen",
    "explanation": {
      "correct": "Severe RUQ/epigastric pain radiating to the back suggests biliary pathology (e.g., acute cholecystitis/biliary colic). Right upper quadrant ultrasound is the best initial and confirmatory test for gallstones, wall thickening, and sonographic Murphy’s sign.",
      "incorrect": [
        {"option": "Liver isotope scan", "reason": "HIDA can help if ultrasound is equivocal, but ultrasound is first-line."},
        {"option": "CT scan of the abdomen with contrast", "reason": "CT is less sensitive for gallstones and not first choice for suspected cholecystitis."},
        {"option": "Upper gastrointestinal endoscopy", "reason": "Assesses mucosa; not for biliary disease diagnosis."},
        {"option": "Transesophageal echocardiography", "reason": "Evaluates cardiac structures, unrelated to biliary pain."}
      ]
    }
  },
  {
    "CaseID": "Emergency_21",
    "case": "A two-year-old boy is rushed by his mother to the Emergency Room with difficult breathing and coughing for the last 2 days. Temperature is 37° C, Respiratory Rate 34/min, HR 100/min. Examination reveals diminished air entry and wheezes on the right side of the chest only. Chest X-ray reveals over distended right lung, especially in expiratory film. What is the most appropriate next management step? [10/2021T_6/2023R_11/2023T_2/2024S_2/2024R]",
    "options": [
      "Perform bronchoscopy (Referral for urgent bronchoscopy)",
      "Use a nebulizer with beta 2 agonist",
      "Administer steroids",
      "Use a nebulizer with ipratropium",
      "Perform chest physiotherapy"
    ],
    "correctAnswer": "Perform bronchoscopy (Referral for urgent bronchoscopy)",
    "explanation": {
      "correct": "Unilateral wheeze with hyperinflation on expiratory film is classic for inhaled foreign body causing ball-valve obstruction. Urgent rigid bronchoscopy is both diagnostic and therapeutic.",
      "incorrect": [
        {"option": "Use a nebulizer with beta 2 agonist", "reason": "May transiently improve wheeze but does not remove the obstruction."},
        {"option": "Administer steroids", "reason": "Not definitive and delays urgent removal."},
        {"option": "Use a nebulizer with ipratropium", "reason": "Symptomatic only; foreign body remains."},
        {"option": "Perform chest physiotherapy", "reason": "Ineffective and potentially harmful with airway obstruction by foreign body."}
      ]
    }
  },
  {
    "CaseID": "Emergency_22",
    "case": "A 56-year-old man presents to the emergency department complaining of a change in skin color, fatigue, discomfort in his hand joints, and abdominal pain. He has also noticed increased urine output and thirst. On examination, his skin appears bronze in color, his liver span is 16 cm, and there is loss of body hair, and testicular atrophy. His ferritin is 600 ng/mL (15-200 ng/mL), aspartate aminotransferase (AST) 130 U/L (8-20 U/L), alanine aminotransferase (ALT) 150 U/L (8-20 U/L), and total bilirubin 0.5 mg/dL (0.1-1 mg/dL). Coagulation tests and albumin level are normal, but the random glucose is elevated at 250 mg/dL. What are the expected hormonal results in this patient? [2/2021R_1/2023M_5/2023M_11/2023T_2/2024T_2/2024R]",
    "options": [
      "Wilson disease",
      "Addison disease",
      "hemochromatosis",
      "amyloidosis",
      "diabetes mellitus (DM)"
    ],
    "correctAnswer": "hemochromatosis",
    "explanation": {
      "correct": "Classic triad of bronze skin, hepatomegaly, and diabetes (\"bronze diabetes\") with very high ferritin indicates hereditary hemochromatosis due to iron overload causing endocrine (hypogonadism, diabetes) and hepatic involvement.",
      "incorrect": [
        {"option": "Wilson disease", "reason": "Copper metabolism disorder presents with low ceruloplasmin, neurologic signs, and Kayser–Fleischer rings, not bronze skin and high ferritin."},
        {"option": "Addison disease", "reason": "Hyperpigmentation with hypotension and hyponatremia; does not explain high ferritin or hepatomegaly from iron overload."},
        {"option": "amyloidosis", "reason": "Can cause organ dysfunction but not bronze pigmentation with elevated iron indices."},
        {"option": "diabetes mellitus (DM)", "reason": "Explains hyperglycemia only; does not account for systemic iron overload signs."}
      ]
    }
  },
  {
    "CaseID": "Emergency_23",
    "case": "A 26-year-old man presents at the emergency department with sudden onset breathlessness. Examination shows him to be dyspneic at rest, with saturations of 80% on room air and a pulse rate of 100 beats/min. His trachea is not deviated, and his blood pressure is 117/82 mm Hg. X-ray revealed a pneumothorax. After administering oxygen, what is the next step of management? [10/2021T_2/2021R_11/2021R_11/2022R_1/2023M-5/2023M_11/2023T_2/2024T_8/2024S]",
    "options": [
      "Intravenous hydrocortisone",
      "Intravenous furosemide",
      "Intercostal tube insertion",
      "Non-invasive ventilation",
      "Nebulized salbutamol"
    ],
    "correctAnswer": "Intercostal tube insertion",
    "explanation": {
      "correct": "Symptomatic pneumothorax with hypoxemia (SpO2 80% on air) requires definitive decompression with intercostal chest tube to re-expand the lung after supplemental oxygen.",
      "incorrect": [
        {"option": "Intravenous hydrocortisone", "reason": "No role in pneumothorax management."},
        {"option": "Intravenous furosemide", "reason": "For pulmonary edema, not pneumothorax."},
        {"option": "Non-invasive ventilation", "reason": "Contraindicated; positive pressure may worsen the pneumothorax."},
        {"option": "Nebulized salbutamol", "reason": "Treats bronchospasm, not intrapleural air."}
      ]
    }
  },
  {
    "CaseID": "Emergency_24",
    "case": "You review a 24-year-old woman with a history of asthma in the Emergency Department. She has been admitted with acute shortness of breath associated with tongue tingling and an urticarial rash after eating a meal containing shellfish. Her symptoms settle with nebulized salbutamol and intravenous hydrocortisone. What is the most useful test to establish whether this episode was due to anaphylaxis? [10/2020T_11/2020T_1/2023M_6/2023S]",
    "options": [
      "Serum tryptase",
      "Serum IGE",
      "Serum histamine",
      "Eosinophil count",
      "CRP"
    ],
    "correctAnswer": "Serum tryptase",
    "explanation": {
      "correct": "Serum tryptase, measured within 1–2 hours of the event, reflects mast cell degranulation and supports anaphylaxis diagnosis when elevated.",
      "incorrect": [
        {"option": "Serum IGE", "reason": "Total IgE is nonspecific; specific IgE tests are for allergies but do not confirm acute anaphylaxis."},
        {"option": "Serum histamine", "reason": "Rises and falls rapidly within minutes; low sensitivity and timing dependent."},
        {"option": "Eosinophil count", "reason": "May be elevated in atopy but not diagnostic of anaphylaxis."},
        {"option": "CRP", "reason": "Marker of inflammation/infection, not for anaphylaxis."}
      ]
    }
  },
  {
    "CaseID": "Emergency_25",
    "case": "A 25 year-old professional football player has sudden pain and swelling in the right groin when attempting to intercept a pass. He is admitted to the local emergency department. On examination, there is a tender swelling in the right groin. The scrotum and penis show no abnormality. What is the next step in management? [12/2020T_11/2022R]",
    "options": [
      "Needle aspiration to exclude hematoma",
      "Forceful manual reduction",
      "Laparotomy within 20 minutes",
      "Preoperative preparation and exploration of the groin with hernia repair",
      "Morphine and re-evaluation within 12 hours"
    ],
    "correctAnswer": "Preoperative preparation and exploration of the groin with hernia repair",
    "explanation": {
      "correct": "Acute tender groin swelling after exertion is concerning for incarcerated/strangulated inguinal hernia. Definitive management is urgent operative exploration and hernia repair.",
      "incorrect": [
        {"option": "Needle aspiration to exclude hematoma", "reason": "Risks injury and infection; does not address a strangulated hernia."},
        {"option": "Forceful manual reduction", "reason": "May reduce necrotic bowel into the abdomen (reduction en masse) and is contraindicated with tenderness and suspected strangulation."},
        {"option": "Laparotomy within 20 minutes", "reason": "Inguinal approach is appropriate; midline laparotomy is unnecessary unless peritonitis or uncertain diagnosis."},
        {"option": "Morphine and re-evaluation within 12 hours", "reason": "Delays definitive care, increasing risk of ischemia."}
      ]
    }
  },
  {
    "CaseID": "Emergency_26",
    "case": "A7-year-old boy brought to the emergency room with generalized urticarial rash 15-minutes following ingestion of nuts. Which of the following is a clinical manifestation of anaphylactic shock? [11/2023T_2/2024S]",
    "options": [
      "Cough",
      "Hypotension",
      "Hypertension",
      "Cold skin",
      "Sore throat"
    ],
    "correctAnswer": "Hypotension",
    "explanation": {
      "correct": "Anaphylaxis is a systemic hypersensitivity reaction; distributive shock from massive vasodilation manifests as hypotension, often with urticaria and airway symptoms.",
      "incorrect": [
        {"option": "Cough", "reason": "Nonspecific; may occur but does not define shock."},
        {"option": "Hypertension", "reason": "Contrary to the vasodilatory physiology of anaphylaxis."},
        {"option": "Cold skin", "reason": "Skin is often warm/flushed in distributive shock; cool clammy skin is more typical of hypovolemia."},
        {"option": "Sore throat", "reason": "Nonspecific and not a hemodynamic manifestation of shock."}
      ]
    }
  },
  {
    "CaseID": "Emergency_27",
    "case": "A 4-year-old boy brought to the emergency room with flushed skin, after he received an intramuscular injection of antibiotic. Which of the following is a clinical manifestation of anaphylaxis? [12/2020T_12/2021T_11/2023S_11/2023R_2/2024T_8/2024T_8/2024S]",
    "options": [
      "Cough",
      "Hypotension",
      "Hypertension",
      "Cold skin",
      "Sore throat"
    ],
    "correctAnswer": "Hypotension",
    "explanation": {
      "correct": "Hypotension due to systemic vasodilation and increased vascular permeability is a hallmark of anaphylaxis.",
      "incorrect": [
        {"option": "Cough", "reason": "Nonspecific and not diagnostic of anaphylaxis with shock."},
        {"option": "Hypertension", "reason": "Opposite of expected hemodynamic change in anaphylaxis."},
        {"option": "Cold skin", "reason": "More typical of hypovolemic shock; anaphylaxis often shows warm, flushed skin early."},
        {"option": "Sore throat", "reason": "May occur but is not a defining hemodynamic sign."}
      ]
    }
  },
  {
    "CaseID": "Emergency_28",
    "case": "A 44-year-old woman, with a history of depression, presents to the emergency department complaining of feeling unwell with headaches and blurred vision. She says the headaches have been getting worse over the last two weeks and seem to be worse in the mornings. Her pulse is 40bpm and her blood pressure (BP) is 190/110 mmHg. Fundoscopy reveals bilateral swollen discs and there is diplopia on lateral gaze bilaterally, which of the following is the best next step in her management? [11/2021R_11/2022R_11/2023S_11/2023R_8/2024T_8/2024S]",
    "options": [
      "Request an urgent CT of the brain",
      "Perform a lumbar puncture and measure the CSF pressure",
      "Commence Cefotaxime and Acyclovir",
      "Administer steroids urgently",
      "MRI angiography"
    ],
    "correctAnswer": "Request an urgent CT of the brain",
    "explanation": {
      "correct": "Morning headaches, bradycardia with hypertension (Cushing response), papilledema, and cranial nerve VI palsies indicate raised intracranial pressure. The immediate step is urgent neuroimaging (CT) to exclude mass effect before any LP.",
      "incorrect": [
        {"option": "Perform a lumbar puncture and measure the CSF pressure", "reason": "Contraindicated before imaging in suspected raised ICP due to risk of herniation."},
        {"option": "Commence Cefotaxime and Acyclovir", "reason": "Empiric for suspected meningitis/encephalitis, which is not the leading concern here."},
        {"option": "Administer steroids urgently", "reason": "Steroids may be used for vasogenic edema from tumor but imaging must precede targeted therapy."},
        {"option": "MRI angiography", "reason": "Useful later; CT is faster and adequate for initial evaluation of mass effect."}
      ]
    }
  },
  {
    "CaseID": "Emergency_29",
    "case": "A 66-year-old man with rheumatoid arthritis was sent to accident and emergency by his general practitioner with a history of sudden severe upper abdominal pain, which started centrally in the epigastrium and spread across the upper abdomen. On examination he was in obvious pain, was normotensive but tachycardic and had board-like rigidity of the abdomen. A chest radiograph revealed free gas under the right hemidiaphragm. There was no other relevant previous history. What is the specific treatment advised for this patient? [11/2021R_11/2022R_2/2024S_8/2024S]",
    "options": [
      "Gastrectomy.",
      "LV glucose and proton pump inhibitors.",
      "Peritoneal drainage and nasogastric suction.",
      "Vagotsomy and pylorolasty",
      "Suturing the perforated duodenum and omental patch."
    ],
    "correctAnswer": "Suturing the perforated duodenum and omental patch.",
    "explanation": {
      "correct": "Free intraperitoneal air with peritonitis indicates a perforated peptic ulcer. The standard operation is primary closure of the duodenal perforation with a Graham omental patch, plus lavage and PPI therapy.",
      "incorrect": [
        {"option": "Gastrectomy.", "reason": "Excessive for an acute perforated duodenal ulcer without malignancy."},
        {"option": "LV glucose and proton pump inhibitors.", "reason": "Supportive; does not address the perforation surgically."},
        {"option": "Peritoneal drainage and nasogastric suction.", "reason": "Adjuncts only; definitive repair is required."},
        {"option": "Vagotsomy and pylorolasty", "reason": "Definitive antiulcer surgery is rarely performed acutely; omental patch is standard."}
      ]
    }
  },
  {
    "CaseID": "Emergency_30",
    "case": "A 65-year-old man presents to the emergency department complaining of weakness. On examination, his blood pressure is 85/46 mmHg, and his heart rate is 89 beats/min. He is pale, and his digital rectal examination reveals melena. Laboratory studies are remarkable for a hemoglobin of 5 g/dL. What is the most appropriate initial step in the management of this patient? [1/2021T_10/2021T_11/2021R_11/2022R_8/2024S]",
    "options": [
      "Infusion of proton pump inhibitors",
      "Infusion of an inotrope",
      "Infusion of packed red blood cells (PRBCs)",
      "Infusion of erythropoietin",
      "Infusion of iron"
    ],
    "correctAnswer": "Infusion of packed red blood cells (PRBCs)",
    "explanation": {
      "correct": "He has acute upper GI bleeding with hemodynamic compromise and critical anemia (Hb 5 g/dL). Immediate stabilization with PRBC transfusion is the priority to restore oxygen-carrying capacity while arranging definitive hemostasis.",
      "incorrect": [
        {"option": "Infusion of proton pump inhibitors", "reason": "Helpful adjunct but does not address life-threatening anemia."},
        {"option": "Infusion of an inotrope", "reason": "Not first-line; shock here is from blood loss and anemia, not pump failure."},
        {"option": "Infusion of erythropoietin", "reason": "Too slow for acute hemorrhage; used in chronic anemia."},
        {"option": "Infusion of iron", "reason": "Ineffective acutely; iron repletion is for chronic deficiency, not active bleeding."}
      ]
    }
  },
  {
    "CaseID": "Emergency_31",
    "case": "A 40-year-old man presents to the emergency department with sudden severe chest pain radiating to the back between the scapulae. The pain began 1 hour ago while he was at rest. He has a history of long-standing uncontrolled hypertension. On examination, blood pressure is 200/120 mmHg in the right arm and 160/90 mmHg in the left arm. There is a faint early diastolic murmur best heard at the left sternal border. Chest X-ray shows a widened mediastinum. What is the most likely diagnosis? [2/2023S_6/2023R_8/2024S]",
    "options": [
      "Acute myocardial infarction",
      "Aortic dissection",
      "Pericardial tamponade",
      "Pulmonary embolism",
      "Aortic aneurysm rupture"
    ],
    "correctAnswer": "Aortic dissection",
    "explanation": {
      "correct": "Severe tearing chest pain radiating to the back, inter-arm BP difference, and widened mediastinum are classic for aortic dissection. The diastolic murmur is due to aortic regurgitation from valve involvement.",
      "incorrect": [
        {"option": "Acute myocardial infarction", "reason": "Pain is usually pressure-like and not tearing; no mediastinal widening or inter-arm BP difference."},
        {"option": "Pericardial tamponade", "reason": "Presents with muffled heart sounds, hypotension, and JVD (Beck’s triad), not tearing back pain."},
        {"option": "Pulmonary embolism", "reason": "Causes pleuritic chest pain and dyspnea but no mediastinal widening."},
        {"option": "Aortic aneurysm rupture", "reason": "Usually presents with hypotension and shock, not hypertension and inter-arm pressure difference."}
      ]
    }
  },
  {
    "CaseID": "Emergency_32",
    "case": "A 55-year-old man presents to the emergency department with sudden severe epigastric pain radiating to the back. The pain started 4 hours ago after a heavy meal. He has a history of chronic alcoholism. On examination, he appears distressed, pulse 110/min, blood pressure 90/60 mmHg, abdomen is distended and tender in the epigastrium with absent bowel sounds. Serum amylase is markedly elevated. What is the most likely diagnosis? [11/2022R_1/2023M_6/2023R_2/2024S]",
    "options": [
      "Perforated peptic ulcer",
      "Acute cholecystitis",
      "Acute pancreatitis",
      "Mesenteric ischemia",
      "Acute appendicitis"
    ],
    "correctAnswer": "Acute pancreatitis",
    "explanation": {
      "correct": "Severe epigastric pain radiating to the back with elevated serum amylase and history of alcoholism indicates acute pancreatitis. The pain worsens after meals due to pancreatic stimulation.",
      "incorrect": [
        {"option": "Perforated peptic ulcer", "reason": "Presents with sudden pain and peritonitis but amylase is not markedly elevated."},
        {"option": "Acute cholecystitis", "reason": "Pain is more localized to right upper quadrant and Murphy’s sign positive, not epigastric radiating to back."},
        {"option": "Mesenteric ischemia", "reason": "Typically affects elderly with vascular disease, pain out of proportion to findings, no amylase rise."},
        {"option": "Acute appendicitis", "reason": "Pain starts periumbilically then localizes to RLQ, not epigastric radiating to back."}
      ]
    }
  },
  {
    "CaseID": "Emergency_33",
    "case": "A 28-year-old woman presents to the emergency department with shortness of breath and sharp pleuritic chest pain that began suddenly while watching TV. She is on oral contraceptive pills. Examination shows mild tachypnea and tachycardia; chest is clear. ECG shows sinus tachycardia. D-dimer is elevated. Which of the following is the most likely diagnosis? [11/2021R_11/2022R_6/2023S_8/2024S]",
    "options": [
      "Pulmonary embolism",
      "Pneumonia",
      "Acute pericarditis",
      "Aortic dissection",
      "Pneumothorax"
    ],
    "correctAnswer": "Pulmonary embolism",
    "explanation": {
      "correct": "Sudden pleuritic chest pain and dyspnea in a young woman on OCPs with elevated D-dimer suggest pulmonary embolism due to thrombus from deep vein thrombosis reaching pulmonary arteries.",
      "incorrect": [
        {"option": "Pneumonia", "reason": "Would present with fever, productive cough, and focal crepitations — absent here."},
        {"option": "Acute pericarditis", "reason": "Causes central chest pain relieved by leaning forward and may have pericardial rub, not pleuritic pain or high D-dimer."},
        {"option": "Aortic dissection", "reason": "Typically presents with tearing pain radiating to back and unequal pulses; not pleuritic."},
        {"option": "Pneumothorax", "reason": "Causes decreased breath sounds and hyperresonance on one side, not clear chest bilaterally."}
      ]
    }
  },
  {
    "CaseID": "Emergency_34",
    "case": "A 32-year-old man is brought to the emergency room with multiple stab wounds to the left chest. He is pale, anxious, and tachycardic with a pulse rate of 125/min and blood pressure of 85/60 mmHg. Neck veins are distended, heart sounds are muffled, and the trachea is central. What is the most likely diagnosis? [2/2023T_2/2024S]",
    "options": [
      "Tension pneumothorax",
      "Hemothorax",
      "Cardiac tamponade",
      "Massive pulmonary embolism",
      "Flail chest"
    ],
    "correctAnswer": "Cardiac tamponade",
    "explanation": {
      "correct": "Beck’s triad (hypotension, muffled heart sounds, distended neck veins) following penetrating chest trauma is diagnostic of cardiac tamponade due to accumulation of blood in the pericardial sac compressing the heart.",
      "incorrect": [
        {"option": "Tension pneumothorax", "reason": "Would cause tracheal deviation and absent breath sounds on affected side, not muffled heart sounds."},
        {"option": "Hemothorax", "reason": "Produces dullness to percussion and decreased breath sounds, no distended neck veins."},
        {"option": "Massive pulmonary embolism", "reason": "Usually follows DVT, not trauma; neck veins may be distended but heart sounds not muffled."},
        {"option": "Flail chest", "reason": "Characterized by paradoxical chest movement, not JVD or muffled sounds."}
      ]
    }
  },
  {
    "CaseID": "Emergency_35",
    "case": "A 68-year-old man presents to the emergency department with severe shortness of breath and pink frothy sputum. He has a history of hypertension and ischemic heart disease. On examination, he is tachypneic, with bilateral basal crackles and an S3 gallop. What is the most appropriate immediate management? [10/2021T_6/2023R]",
    "options": [
      "Intravenous furosemide",
      "Oral carvedilol",
      "Intravenous fluids",
      "Nebulized ipratropium",
      "Intravenous digoxin"
    ],
    "correctAnswer": "Intravenous furosemide",
    "explanation": {
      "correct": "This is acute pulmonary edema due to left ventricular failure. IV furosemide rapidly relieves pulmonary congestion by reducing preload and promoting diuresis.",
      "incorrect": [
        {"option": "Oral carvedilol", "reason": "Beta-blockers are avoided in acute decompensation; used only chronically when stable."},
        {"option": "Intravenous fluids", "reason": "Would worsen pulmonary edema by increasing preload."},
        {"option": "Nebulized ipratropium", "reason": "Used for bronchospasm, not cardiac failure."},
        {"option": "Intravenous digoxin", "reason": "Has delayed action; not effective for immediate relief in pulmonary edema."}
      ]
    }
  },
  {
    "CaseID": "Emergency_36",
    "case": "A 30-year-old man presents to the emergency room after a road traffic accident. He is conscious but has severe abdominal pain and tenderness. Blood pressure is 80/50 mmHg and pulse 130/min. FAST ultrasound shows free fluid in the abdomen. What is the next appropriate step in management? [11/2021R_6/2023S_8/2024R]",
    "options": [
      "CT scan of the abdomen with contrast",
      "Diagnostic peritoneal lavage",
      "Immediate exploratory laparotomy",
      "Abdominal paracentesis",
      "Observation and IV fluids"
    ],
    "correctAnswer": "Immediate exploratory laparotomy",
    "explanation": {
      "correct": "Hypotension with positive FAST (free intraperitoneal fluid) after trauma indicates intra-abdominal hemorrhage. The definitive next step is immediate exploratory laparotomy for hemostasis.",
      "incorrect": [
        {"option": "CT scan of the abdomen with contrast", "reason": "Only for hemodynamically stable patients; this patient is unstable."},
        {"option": "Diagnostic peritoneal lavage", "reason": "Superseded by FAST; unnecessary when free fluid already identified."},
        {"option": "Abdominal paracentesis", "reason": "Not indicated; diagnostic not therapeutic in trauma."},
        {"option": "Observation and IV fluids", "reason": "Delays life-saving surgery; not appropriate in shock with internal bleeding."}
      ]
    }
  },
  {
    "CaseID": "Emergency_37",
    "case": "A 45-year-old woman presents to the emergency department with sudden onset of shortness of breath and pleuritic chest pain. She has been on bed rest for 10 days following knee surgery. Examination shows tachycardia and mild hypoxemia. What is the best initial diagnostic investigation? [11/2023T_2/2024S]",
    "options": [
      "CT pulmonary angiography",
      "Ventilation–perfusion (V/Q) scan",
      "Chest X-ray",
      "ECG",
      "D-dimer assay"
    ],
    "correctAnswer": "D-dimer assay",
    "explanation": {
      "correct": "This is a classic presentation of pulmonary embolism (postoperative immobilization + pleuritic pain). D-dimer is the best initial screening test; if elevated, confirm with CT pulmonary angiography.",
      "incorrect": [
        {"option": "CT pulmonary angiography", "reason": "Definitive test but performed after D-dimer if clinical suspicion is moderate."},
        {"option": "Ventilation–perfusion (V/Q) scan", "reason": "Alternative if CT contraindicated; not the first-line initial test."},
        {"option": "Chest X-ray", "reason": "Often normal; used to rule out other causes, not to diagnose PE."},
        {"option": "ECG", "reason": "May show sinus tachycardia or S1Q3T3 but not diagnostic."}
      ]
    }
  },
  {
    "CaseID": "Emergency_38",
    "case": "A 70-year-old man with a history of ischemic heart disease and atrial fibrillation presents to the emergency department with sudden severe abdominal pain. The pain is diffuse and out of proportion to physical findings. His abdomen is soft with minimal tenderness. Serum lactate is elevated. What is the most likely diagnosis? [1/2023M_6/2023S_11/2023R_8/2024S]",
    "options": [
      "Acute mesenteric ischemia",
      "Perforated peptic ulcer",
      "Acute pancreatitis",
      "Intestinal obstruction",
      "Acute appendicitis"
    ],
    "correctAnswer": "Acute mesenteric ischemia",
    "explanation": {
      "correct": "Severe abdominal pain disproportionate to minimal exam findings in an elderly patient with atrial fibrillation is classic for acute mesenteric ischemia due to embolic occlusion of mesenteric vessels.",
      "incorrect": [
        {"option": "Perforated peptic ulcer", "reason": "Causes peritonitis with rigid abdomen, not minimal tenderness."},
        {"option": "Acute pancreatitis", "reason": "Associated with epigastric tenderness and raised amylase/lipase, not disproportionate pain."},
        {"option": "Intestinal obstruction", "reason": "Would show distension, vomiting, and high-pitched bowel sounds, not soft abdomen."},
        {"option": "Acute appendicitis", "reason": "Localized RLQ pain, not diffuse severe pain with minimal findings."}
      ]
    }
  },
  {
    "CaseID": "Emergency_39",
    "case": "A 24-year-old man is brought to the emergency department after being rescued from a house fire. He is conscious but confused. He has singed nasal hairs, facial burns, and carbonaceous sputum. His pulse is 110/min, BP 100/60 mmHg, and SpO2 98% on room air. Which of the following is the most appropriate next step in management? [11/2022R_2/2024S]",
    "options": [
      "Administer 100% oxygen via non-rebreather mask",
      "Endotracheal intubation",
      "Perform bronchoscopy",
      "Administer corticosteroids",
      "Give IV antibiotics"
    ],
    "correctAnswer": "Administer 100% oxygen via non-rebreather mask",
    "explanation": {
      "correct": "Facial burns with carbonaceous sputum indicate inhalation injury and possible carbon monoxide poisoning. The immediate step is 100% oxygen via non-rebreather mask to displace CO from hemoglobin.",
      "incorrect": [
        {"option": "Endotracheal intubation", "reason": "Indicated if airway edema develops; first give high-flow oxygen."},
        {"option": "Perform bronchoscopy", "reason": "For assessment but not the initial management step."},
        {"option": "Administer corticosteroids", "reason": "No proven benefit in smoke inhalation injury."},
        {"option": "Give IV antibiotics", "reason": "Not indicated unless infection suspected; this is chemical injury."}
      ]
    }
  },
  {
    "CaseID": "Emergency_40",
    "case": "A 60-year-old man with chronic obstructive pulmonary disease (COPD) is brought to the emergency room with severe shortness of breath and confusion. ABG shows: pH 7.25, PaCO2 80 mmHg, HCO3- 32 mEq/L, PaO2 55 mmHg on 2L nasal oxygen. What is the next appropriate management step? [10/2021T_11/2022R_11/2023R_2/2024S]",
    "options": [
      "Increase oxygen to 10 L/min via face mask",
      "Start non-invasive positive pressure ventilation (BiPAP)",
      "Start intravenous antibiotics",
      "Perform immediate intubation and ventilation",
      "Give bronchodilator nebulization only"
    ],
    "correctAnswer": "Start non-invasive positive pressure ventilation (BiPAP)",
    "explanation": {
      "correct": "The ABG shows acute-on-chronic respiratory acidosis due to CO2 retention. The best next step in a conscious patient is non-invasive ventilation (BiPAP) to improve ventilation and reduce CO2 levels.",
      "incorrect": [
        {"option": "Increase oxygen to 10 L/min via face mask", "reason": "High-flow oxygen may worsen CO2 retention by reducing hypoxic drive."},
        {"option": "Start intravenous antibiotics", "reason": "May be needed later if infection present but not the immediate intervention."},
        {"option": "Perform immediate intubation and ventilation", "reason": "Reserved for unconscious or BiPAP failure; here the patient is still responsive."},
        {"option": "Give bronchodilator nebulization only", "reason": "Helps airway obstruction but not sufficient alone for CO2 retention."}
      ]
    }
  },
  {
    "CaseID": "Emergency_46",
    "case": "A 77-year-old man presents to the emergency department complaining of dizziness and tiredness. On direct questioning he tells you she has recently been having black stools. He is currently awaiting a total hip replacement for arthritis. Which of the following would be most useful in establishing the primary cause of her symptoms? [12/2021T_2/2024S]",
    "options": [
      "Barium meal",
      "Coagulation screen",
      "Faecal occult blood",
      "Full blood count",
      "Oesophagogastroduodenoscopy"
    ],
    "correctAnswer": "Full blood count",
    "explanation": {
      "correct": "Dizziness and tiredness in the setting of melena point to symptomatic anemia from GI blood loss. The single most useful test to establish the primary cause of his symptoms (fatigue, dizziness) is a Full blood count to confirm the degree of anemia and guide urgent management.",
      "incorrect": [
        {"option": "Barium meal", "reason": "Not appropriate in acute or recent GI bleeding and offers no immediate information on symptomatic anemia."},
        {"option": "Coagulation screen", "reason": "May identify coagulopathy but does not establish the primary cause of the patient’s symptoms (anemia)."},
        {"option": "Faecal occult blood", "reason": "Unnecessary when overt melena is present; it does not quantify anemia."},
        {"option": "Oesophagogastroduodenoscopy", "reason": "Useful to find bleeding source but the question asks for the most useful test to establish the cause of his symptoms (anemia), which is FBC."}
      ]
    }
  },
  {
    "CaseID": "Emergency_47",
    "case": "A 3-month-old male comes to the emergency room with a history of upper respiratory symptoms for 3 days, fever, decreased appetite and increased work of breathing. On exam his vitals are T37.2°C, RR 40, HR 185, BP 90/65, and Sat 95% on room air; he has mild retractions and coarse breath sounds. Which of the following is the MOST appropriate next step in management? [11/2023R_2/2024R_8/2024R]",
    "options": [
      "Give oral corticosteroid",
      "Start antihistamine",
      "Start albuterol",
      "Suction to remove secretions",
      "Supplementary oxygen"
    ],
    "correctAnswer": "Suction to remove secretions",
    "explanation": {
      "correct": "Classic bronchiolitis in an infant with adequate oxygenation (SpO2 95%) is managed supportively. The most helpful immediate step is nasal/pharyngeal suctioning to relieve mucus plugging and improve work of breathing.",
      "incorrect": [
        {"option": "Give oral corticosteroid", "reason": "Steroids are not routinely effective in bronchiolitis."},
        {"option": "Start antihistamine", "reason": "No role in bronchiolitis and may thicken secretions."},
        {"option": "Start albuterol", "reason": "Trial can be considered in select cases, but routine use is not recommended; first priority is airway toileting."},
        {"option": "Supplementary oxygen", "reason": "Indicated if SpO2 < 90–92%; this infant maintains 95% on room air."}
      ]
    }
  },
  {
    "CaseID": "Emergency_48",
    "case": "A 3-year-old girl brought to the emergency room for evaluation of fever and cough for 3 days. Her temperature was 39.5 °C, HR 120bpm, RR 30/min, SpO2 96% on room air. On exam, she is alert with no respiratory distress. Diminished breath sounds are noted in the right base. Which antibiotic would be the most appropriate for that girl [11/2023R_2/2024R_8/2024R]",
    "options": [
      "Trimethoprim sulfamethoxazole",
      "Acyclovir",
      "Ceftriaxone",
      "Azithromycin",
      "Amoxicillin"
    ],
    "correctAnswer": "Amoxicillin",
    "explanation": {
      "correct": "Outpatient community-acquired pneumonia in a preschool child is most often due to Streptococcus pneumoniae; high-dose Amoxicillin is first-line empiric therapy when the child is stable and oxygenating well.",
      "incorrect": [
        {"option": "Trimethoprim sulfamethoxazole", "reason": "Not first-line for typical pediatric CAP and has inadequate pneumococcal coverage."},
        {"option": "Acyclovir", "reason": "Antiviral with no role in bacterial CAP."},
        {"option": "Ceftriaxone", "reason": "Parenteral therapy reserved for inpatient or severe cases, not stable outpatient management."},
        {"option": "Azithromycin", "reason": "Covers atypicals; in <5 years typical bacterial pathogens predominate; beta-lactam preferred."}
      ]
    }
  },
  {
    "CaseID": "Emergency_49",
    "case": "A 4-year-old girl was brought to the emergency room for evaluation of fever and cough for 3 days. Her temperature was 39.5 °C, HR 120 beats/minute, RR 30/minute, SpO2 96% on room air. On examination, he is alert with no respiratory distress. Diminished breath sounds are noted in the right base. Which of the following actions would be appropriate? [2/2024R_8/2024R]",
    "options": [
      "Oral antibiotics at home and revisit OPC after 3 days",
      "Plain chest x-ray PA and lateral",
      "Immediate IV placement for fluids and antibiotics",
      "Immediate IV placement for fluids and antibiotics",
      "Admission to the inpatient word"
    ],
    "correctAnswer": "Oral antibiotics at home and revisit OPC after 3 days",
    "explanation": {
      "correct": "Stable child with likely community-acquired pneumonia (high fever, focal exam) and normal oxygenation can be managed as an outpatient with oral antibiotics and close follow-up within 48–72 hours.",
      "incorrect": [
        {"option": "Plain chest x-ray PA and lateral", "reason": "Imaging is not routinely required in an otherwise stable outpatient pneumonia."},
        {"option": "Immediate IV placement for fluids and antibiotics", "reason": "Duplicated option; IV therapy is unnecessary in a well-appearing, oxygenating child."},
        {"option": "Immediate IV placement for fluids and antibiotics", "reason": "Same as above—overtreatment for stable outpatient CAP."},
        {"option": "Admission to the inpatient word", "reason": "No hypoxia or distress; hospitalization not indicated."}
      ]
    }
  },
  {
    "CaseID": "Emergency_50",
    "case": "A 50-year-old man is brought to the emergency department by paramedics 2 hours after he vomited a large amount of blood. He has no history of similar episodes. One year ago, he sustained trauma to his back L2 Stable fracture. He takes non-steroidal anti-inflammatory drugs as needed for pain. He has no other history of serious illness and takes no routine medications. He drinks 3 glasses of wine daily. His temperature is 37°C, pulse is 115/min, respirations are 19/min, and blood pressure is 100/60 mm Hg. Physical examination shows mild conjunctival icterus. Cardiopulmonary examination discloses no abnormalities. Abdominal examination discloses mild ascites. The liver edge is palpated 3 cm below the right costal margin. The spleen tip is palpated 4 cm below the left costal margin. There is no edema of the lower extremities. Nasogastric aspiration yields 250 mL of bright red blood. The patient is 4 units of packed red blood cells are transfused, and 2 liters of 0.9% saline is administered. Which of the following is the most appropriate next step in management? [2/2024T]#",
    "options": [
      "Perform upper gastrointestinal endoscopy to identify the source of bleeding"
    ],
    "correctAnswer": "Perform upper gastrointestinal endoscopy to identify the source of bleeding",
    "explanation": {
      "correct": "After initial resuscitation of an upper GI bleed, urgent diagnostic and therapeutic upper endoscopy is indicated to identify and treat the source (e.g., varices, peptic ulcer).",
      "incorrect": []
    }
  },
  {
    "CaseID": "Emergency_51",
    "case": "A 32-year-old woman para 0+4 presented to emergency department at 30 weeks of her pregnancy. She was complaining of left lower limb swelling and pain. Duplex revealed DVT of left lower limb. Which of the following is the first priority in caring for this patient? [2/2024R]#",
    "options": [
      "Therapeutic heparin therapy"
    ],
    "correctAnswer": "Therapeutic heparin therapy",
    "explanation": {
      "correct": "Pregnancy-associated DVT requires immediate anticoagulation with therapeutic heparin (LMWH preferred) because warfarin is teratogenic and untreated DVT risks fatal PE.",
      "incorrect": []
    }
  },
  {
    "CaseID": "Emergency_52",
    "case": "A 30-year-old woman Para 2, presented to emergency department at 20 weeks of her pregnancy complaining of dysuria, rigors and loin pain. Her urinalysis revealed pus cells >100 phf. Which of the following is the most appropriate next step in her management? [2/2024R]#",
    "options": [
      "I.V. Fluids, anti-pyretics and antibiotics."
    ],
    "correctAnswer": "I.V. Fluids, anti-pyretics and antibiotics.",
    "explanation": {
      "correct": "This is pyelonephritis in pregnancy—an inpatient condition requiring immediate IV fluids for resuscitation, antipyretics, and IV antibiotics safe in pregnancy.",
      "incorrect": []
    }
  },
  {
    "CaseID": "Emergency_53",
    "case": "A 24-month-old-boy is brought to emergency room immediately after finding him with an empty drug bottle at home. He has vomited once, fussy, and lethargic. On examination, his weight=13-kg, tachypnea and tachycardia were present. His Labs; blood sugar=230mg/dl, pH=7.5, PCO2=20 mEq/L, and HCO3=20 mEq/L. Which of the following is the MOST likely ingested drug? [2/2024R]#",
    "options": [
      "Salicylate",
      "Atropine"
    ],
    "correctAnswer": "Salicylate",
    "explanation": {
      "correct": "Mixed picture with primary respiratory alkalosis (low PCO2, elevated pH) and near-compensated metabolic acidosis is classic early salicylate toxicity; hyperglycemia may be seen. At this age, accidental salicylate ingestion is common.",
      "incorrect": [
        {"option": "Atropine", "reason": "Would cause anticholinergic toxidrome (hyperthermia, mydriasis, dry mucosa, urinary retention) without the characteristic respiratory alkalosis."}
      ]
    }
  },
  {
    "CaseID": "Emergency_54",
    "case": "A 34-year-old man presents to the emergency department (ED) after an episode of hematemesis. Upper endoscopy confirms a Mallory Weiss tear with no residual bleeding. Which of the following is the proper treatment of this condition? [2/2024R]",
    "options": [
      "esophagectomy",
      "Observation",
      "Proximal gastrectomy with esophago-jejunostomy",
      "Injection of botulinum toxin",
      "Urgent surgical repair"
    ],
    "correctAnswer": "Observation",
    "explanation": {
      "correct": "A Mallory–Weiss tear that has stopped bleeding typically requires supportive care and observation; most heal spontaneously without intervention.",
      "incorrect": [
        {"option": "esophagectomy", "reason": "Radical and not indicated for mucosal lacerations."},
        {"option": "Proximal gastrectomy with esophago-jejunostomy", "reason": "Inappropriate for a benign mucosal tear."},
        {"option": "Injection of botulinum toxin", "reason": "Used for achalasia/spasm, not bleeding tears."},
        {"option": "Urgent surgical repair", "reason": "Reserved for refractory bleeding; endoscopic therapy is preferred if needed."}
      ]
    }
  },
  {
    "CaseID": "Emergency_55",
    "case": "A 60-year-old woman was brought to the emergency department with acute shortness of breath, cough & expectoration of frothy blood tinged sputum. The patient is diabetic. On examination, she has fine bilateral basal crepitations. On echocardiography, ejection fraction was 25%. Which of the following medications is contraindicated in this patient? [2/2024R]#",
    "options": [
      "Thiazolidinediones"
    ],
    "correctAnswer": "Thiazolidinediones",
    "explanation": {
      "correct": "Thiazolidinediones (e.g., pioglitazone) cause fluid retention and can precipitate or worsen congestive heart failure; they are contraindicated in patients with symptomatic HF and reduced EF.",
      "incorrect": []
    }
  },
  {
    "CaseID": "Emergency_56",
    "case": "A 54-year-old man presents to the ED with acute onset of severe abdominal pain. His history is significant for gnawing epigastric pain that radiates to the back for several months. Physical examination demonstrates mild hypertension and tachycardia as well as a rigid board like\" abdomen with generalized rebound tenderness and hypoactive bowel sounds. Rectal examination reveals dark hemoccult positive stools without gross blood. Which of the following would be the next appropriate step in management? [2/2024R]",
    "options": [
      "Ordering upright chest and abdomen X-rays",
      "Obtaining a CT scan of the abdomen and pelvis",
      "Planning for upper GI endoscopy",
      "Taking the patient to the OR for immediate exploratory laparotomy",
      "Scheduling the patient to be seen in surgery clinic in 1 week"
    ],
    "correctAnswer": "Taking the patient to the OR for immediate exploratory laparotomy",
    "explanation": {
      "correct": "A rigid, board-like abdomen with generalized rebound indicates peritonitis from likely perforated viscus. Hemodynamic changes add urgency. Immediate exploratory laparotomy is required; imaging delays definitive care.",
      "incorrect": [
        {"option": "Ordering upright chest and abdomen X-rays", "reason": "May show free air but should not delay surgery in frank peritonitis."},
        {"option": "Obtaining a CT scan of the abdomen and pelvis", "reason": "Appropriate only if diagnosis is unclear and the patient is stable; here peritonitis mandates OR."},
        {"option": "Planning for upper GI endoscopy", "reason": "Contraindicated with suspected perforation and peritonitis."},
        {"option": "Scheduling the patient to be seen in surgery clinic in 1 week", "reason": "Dangerously delays life-saving intervention."}
      ]
    }
  },
  {
    "CaseID": "Emergency_57",
    "case": "A 54-year-old otherwise healthy woman presents to the emergency department with abdominal pain, ever, chills, and confusion. Blood pressure is 95/50, heart rate 110, and temperature 39C. Laboratory tests demonstrate a white blood cell count of 15,000, normal hematocrit and platelets, as well as a direct bilirubin of 7.2mg. Which of the following is the initial management of this case? [2/2024R]",
    "options": [
      "Emergency biliary decompression endoscopically or transhepatically",
      "Emergent cholecystectomy.",
      "Intravenous (IV) fluid resuscitation and antibiotics.",
      "Observation and pain control",
      "Discharge to home with oral antibiotics with planned cholecystectomy in the coming weeks."
    ],
    "correctAnswer": "Intravenous (IV) fluid resuscitation and antibiotics.",
    "explanation": {
      "correct": "Septic physiology with fever, hypotension, leukocytosis, and direct hyperbilirubinemia suggests acute cholangitis. Initial management is aggressive IV fluids and broad-spectrum IV antibiotics; biliary drainage follows after stabilization.",
      "incorrect": [
        {"option": "Emergency biliary decompression endoscopically or transhepatically", "reason": "Required after initial resuscitation; stabilize first."},
        {"option": "Emergent cholecystectomy.", "reason": "Definitive gallbladder surgery is not first; source control is biliary decompression after resuscitation."},
        {"option": "Observation and pain control", "reason": "Inadequate in sepsis; risks deterioration."},
        {"option": "Discharge to home with oral antibiotics with planned cholecystectomy in the coming weeks.", "reason": "Unsafe disposition in a septic patient with hypotension."}
      ]
    }
  },
  {
    "CaseID": "Emergency_58",
    "case": "An infant presents to the emergency room with bilious emesis and irritability, Physical examination is notable for abdominal tenderness and erythema of the abdominal wall. Abdominal X-ray demonstrates dilated proximal bowel with air-fluid levels. Which of the following is the most appropriate next step in management, after resuscitation? [2/2024R]",
    "options": [
      "Colonoscopy",
      "Upper gastrointestinal series",
      "Barium enema",
      "Gastrostomy",
      "Laparotomy"
    ],
    "correctAnswer": "Laparotomy",
    "explanation": {
      "correct": "Bilious emesis with abdominal wall erythema and peritoneal signs suggests bowel ischemia/volvulus with impending perforation; after initial resuscitation, proceed to urgent laparotomy rather than delay with imaging.",
      "incorrect": [
        {"option": "Colonoscopy", "reason": "Contraindicated in suspected ischemia/perforation in infants."},
        {"option": "Upper gastrointestinal series", "reason": "Used to diagnose malrotation when stable; here signs mandate immediate surgery."},
        {"option": "Barium enema", "reason": "Not appropriate in suspected ischemia or perforation risk."},
        {"option": "Gastrostomy", "reason": "Not a treatment for acute obstructive/ischemic emergency."}
      ]
    }
  },
  {
    "CaseID": "Emergency_59",
    "case": "A 45-year-old man was brought to the emergency department with a pale, pulseless, paresthetic, painful, and paralytic right lower extremity. The process began suddenly 2 hours ago. On examination, no pulses are apparent in the right lower extremity pulse at the wrist is 95 beats/min and grossly irregular. Treatment would likely be based on which of the following? [2/2024R]",
    "options": [
      "Dacron prosthetic vascular conduits",
      "Fogarty balloon tipped catheters",
      "Heparin and dicumarol",
      "Saphenous vein bypasses",
      "Selective sympathetic blocks"
    ],
    "correctAnswer": "Fogarty balloon tipped catheters",
    "explanation": {
      "correct": "Sudden onset of the 6 Ps in a limb with atrial fibrillation suggests acute arterial embolism. The treatment is urgent surgical embolectomy using a Fogarty balloon-tipped catheter after anticoagulation.",
      "incorrect": [
        {"option": "Dacron prosthetic vascular conduits", "reason": "Used for bypass grafting in chronic occlusive disease, not acute embolus removal."},
        {"option": "Heparin and dicumarol", "reason": "Anticoagulation is started, but definitive therapy is embolectomy for threatened limb."},
        {"option": "Saphenous vein bypasses", "reason": "Bypass is for chronic disease or non-embolectable lesions."},
        {"option": "Selective sympathetic blocks", "reason": "Not indicated in acute limb ischemia from embolus."}
      ]
    }
  },
  {
    "CaseID": "Emergency_60",
    "case": "A 42-year-old primigravida at 32 weeks of gestation comes to emergency department complaining of sudden onset acute pain in her chest on the left side radiating to the shoulder and arm. She has vomiting, epigastric pain and dizziness. Which of the following is the most appropriate diagnostic study to obtain at this time? [2/2024R]",
    "options": [
      "Angiography of pulmonary arteries",
      "Echocardiography",
      "Electrocardiography",
      "Troponin T levels",
      "Ultrasound of the abdomen"
    ],
    "correctAnswer": "Electrocardiography",
    "explanation": {
      "correct": "In a pregnant patient with acute chest pain radiating to the arm and associated autonomic symptoms, the most appropriate immediate diagnostic study is an Electrocardiography to evaluate for acute coronary syndrome or other cardiac causes.",
      "incorrect": [
        {"option": "Angiography of pulmonary arteries", "reason": "Invasive and not the first diagnostic step; consider after initial cardiac workup if PE suspected."},
        {"option": "Echocardiography", "reason": "Useful but follows the immediate ECG in chest pain evaluation."},
        {"option": "Troponin T levels", "reason": "Indicated but drawn in parallel after immediate ECG; ECG is the first, fastest test."},
        {"option": "Ultrasound of the abdomen", "reason": "Does not evaluate the likely cardiac etiology of chest pain radiating to arm."}
      ]
    }
  },
  {
    "CaseID": "Emergency_61",
    "case": "A 24-year-old woman presents to emergency department with a 12 hour history of right-sided chest pain and shortness of breath. She is at 7 days' postnatal having delivered her baby by emergency caesarean section at 34 weeks. Her pregnancy was complicated by severe hypertension and postpartum hemorrhage of 1 L. She has a BMI of 32. Her BP is 130/80 mmhg pulse is 108 bpm, temperature is 37.2°C and oxygen saturations are 94% in air: Which of the following is the most likely diagnosis? [2/2024R]",
    "options": [
      "Anemia",
      "Myocardial infarction",
      "Pneumonia",
      "Subphrenic abscess",
      "Pulmonary embolism"
    ],
    "correctAnswer": "Pulmonary embolism",
    "explanation": {
      "correct": "Recent cesarean section, obesity, and immobility in the postpartum period are strong risk factors for venous thromboembolism. Acute pleuritic chest pain and mild hypoxia point to pulmonary embolism.",
      "incorrect": [
        {"option": "Anemia", "reason": "Would cause fatigue and pallor, not pleuritic chest pain."},
        {"option": "Myocardial infarction", "reason": "Pain is typically central and pressure-like, not pleuritic or postnatal related."},
        {"option": "Pneumonia", "reason": "Would cause fever, cough, and focal findings, not isolated pleuritic pain with tachycardia."},
        {"option": "Subphrenic abscess", "reason": "Occurs post-abdominal surgery with fever and abdominal pain, not sudden chest pain."}
      ]
    }
  },
  {
    "CaseID": "Emergency_62",
    "case": "A 3-year-old boy is brought to the emergency department because of a worsening cough over the past week. His temperature is 38.9°C, and inspiratory stridor is noted. He is noted to have copious thick secretions and a barking cough. He has not had such events previously, and his parents deny recent contact with sick children. The patient is in respiratory distress and is noted to be retracting his subcostal muscles to breathe. Which of the following is the next most appropriate step in management? [2/2024R_8/2024R]",
    "options": [
      "Administering albuterol",
      "Administering racemic epinephrine",
      "Administering corticosteroids",
      "Administering IV penicillin",
      "Endotracheal intubation"
    ],
    "correctAnswer": "Administering racemic epinephrine",
    "explanation": {
      "correct": "The child has severe croup (laryngotracheobronchitis) with stridor at rest and respiratory distress. Nebulized racemic epinephrine provides rapid improvement by reducing airway edema.",
      "incorrect": [
        {"option": "Administering albuterol", "reason": "Useful for bronchospasm, not upper airway edema."},
        {"option": "Administering corticosteroids", "reason": "Important adjunct but acts slowly; not immediate rescue therapy."},
        {"option": "Administering IV penicillin", "reason": "Indicated for bacterial infections like epiglottitis, not viral croup."},
        {"option": "Endotracheal intubation", "reason": "Reserved for impending respiratory failure if epinephrine and steroids fail."}
      ]
    }
  },
  {
    "CaseID": "Emergency_63",
    "case": "A 35-year-old woman is 33 weeks pregnant in her first pregnancy comes to emergency department with headache and blurred vision. Her blood pressure is 180/110 mmHg. Urinalysis shows +++ protein. One week prior, her blood pressure was 120/70 mmHg and she had no proteinuria. Which of the following is the most appropriate pharmacotherapy? [2/2024R]",
    "options": [
      "Oral methyldopa",
      "Intravenous diazepam",
      "Intravenous furosemide",
      "Intramuscular betamethasone",
      "Intravenous magnesium sulphate"
    ],
    "correctAnswer": "Intravenous magnesium sulphate",
    "explanation": {
      "correct": "Severe preeclampsia presents with hypertension and proteinuria with neurologic symptoms. IV magnesium sulfate prevents eclamptic seizures and is the drug of choice.",
      "incorrect": [
        {"option": "Oral methyldopa", "reason": "Used for chronic hypertension in pregnancy, not for acute severe preeclampsia."},
        {"option": "Intravenous diazepam", "reason": "Used for active seizures but not for prophylaxis of eclampsia."},
        {"option": "Intravenous furosemide", "reason": "Not indicated unless pulmonary edema is present."},
        {"option": "Intramuscular betamethasone", "reason": "Given for fetal lung maturity but not to control maternal hypertension or seizures."}
      ]
    }
  },
  {
    "CaseID": "Emergency_64",
    "case": "In an emergency room, a 45-year-old obese man arrived in intense pain, clutching ha right abdomen. He was rapidly diagnosed as having acute cholecystitis. He received immediate treatment with fluids and pain medication. An urgent surgical consult followed which of the following is the most sensitive image modality for this case? [2/2024R]",
    "options": [
      "Abdominal CT",
      "Abdominal MRI",
      "Abdominal ultrasound",
      "Abdominal radiography",
      "Scintigraphy"
    ],
    "correctAnswer": "Abdominal ultrasound",
    "explanation": {
      "correct": "Ultrasound is the first-line and most sensitive imaging modality for diagnosing acute cholecystitis. It detects gallstones, wall thickening, and pericholecystic fluid.",
      "incorrect": [
        {"option": "Abdominal CT", "reason": "CT is less sensitive for gallstones and mainly used for complications."},
        {"option": "Abdominal MRI", "reason": "Reserved for problem-solving or biliary duct evaluation (MRCP)."},
        {"option": "Abdominal radiography", "reason": "Poor diagnostic value; gallstones are often radiolucent."},
        {"option": "Scintigraphy", "reason": "Highly specific (HIDA scan) but not as readily available or first-line."}
      ]
    }
  },
  {
    "CaseID": "Emergency_65",
    "case": "A man who was involved in a high-speed automobile collision arrives at the emergency department in a deep coma. His pupils react poorly to light but are of equal size. An airways placed, and the patient is sent for CT scan of the head with extension to the neck. The study shows no cervical spine fractures, but does reveal a small, crescent-shaped hematoma on the right hemisphere with no deviation of the midline structures. Which of the following is the most appropriate next step in management? [2/2024R]",
    "options": [
      "High-dose steroids",
      "Hyperventilation, diuretics, and fluid restriction",
      "Systemic vasodilators and alpha blockers",
      "Surgical evacuation of his epidural hematoma",
      "Surgical evacuation of his subdural hematoma"
    ],
    "correctAnswer": "Surgical evacuation of his subdural hematoma",
    "explanation": {
      "correct": "A crescent-shaped hematoma represents a subdural hematoma due to venous bleeding. Surgical evacuation is indicated in comatose patients even without midline shift.",
      "incorrect": [
        {"option": "High-dose steroids", "reason": "Not beneficial for traumatic brain injury or hematoma."},
        {"option": "Hyperventilation, diuretics, and fluid restriction", "reason": "Used temporarily to lower ICP but not definitive treatment."},
        {"option": "Systemic vasodilators and alpha blockers", "reason": "Not relevant to intracranial hemorrhage."},
        {"option": "Surgical evacuation of his epidural hematoma", "reason": "Epidural hematoma is lens-shaped, not crescent-shaped."}
      ]
    }
  },
  {
    "CaseID": "Emergency_66",
    "case": "A 2-year-old girl brought to the emergency department. She is responding to pain but bradycardic and has poor perfusion. Which of the following is the MOST important first step in treatment? [2/2024R_8/2024R]",
    "options": [
      "Maintaining adequate perfusion by chest compression",
      "Maintaining the airways and assisted breathing",
      "Treating precipitating factors",
      "Epinephrine therapy",
      "Atropine therapy"
    ],
    "correctAnswer": "Maintaining the airways and assisted breathing",
    "explanation": {
      "correct": "In pediatric bradycardia, hypoxia is the most common cause. The first and most critical step is ensuring airway patency and assisted ventilation with oxygen.",
      "incorrect": [
        {"option": "Maintaining adequate perfusion by chest compression", "reason": "Only if bradycardia persists with poor perfusion after ventilation."},
        {"option": "Treating precipitating factors", "reason": "Addressed later after stabilization."},
        {"option": "Epinephrine therapy", "reason": "Given if bradycardia persists after oxygenation."},
        {"option": "Atropine therapy", "reason": "Used for vagal or primary bradycardia, not hypoxia-related."}
      ]
    }
  },
  {
    "CaseID": "Emergency_67",
    "case": "A 19-year-old gang member is shot in the abdomen with a 38 caliber revolver. The entry wound is in the epigastrium, to the left of the midline. The bullet is lodged in the psoas muscle on the right. He is hemodynamically stable, and the abdomen is moderately tender. Which of the following is the most appropriate next step in diagnosis? [2/2024R]",
    "options": [
      "Close clinical observation",
      "Emergency ultrasound",
      "CT scan of the abdomen",
      "Diagnostic peritoneal lavage",
      "Exploratory laparotomy"
    ],
    "correctAnswer": "CT scan of the abdomen",
    "explanation": {
      "correct": "In hemodynamically stable patients with gunshot wounds to the abdomen, contrast-enhanced CT scan is the best diagnostic study to assess intra-abdominal injury.",
      "incorrect": [
        {"option": "Close clinical observation", "reason": "Unsafe without imaging after penetrating trauma."},
        {"option": "Emergency ultrasound", "reason": "FAST can detect fluid but lacks detail for bullet trajectory."},
        {"option": "Diagnostic peritoneal lavage", "reason": "Replaced by CT in stable trauma evaluation."},
        {"option": "Exploratory laparotomy", "reason": "Reserved for unstable patients or peritonitis."}
      ]
    }
  },
  {
    "CaseID": "Emergency_68",
    "case": "A 45-year-old man presents to the emergency department with emesis of bright red blood. Laboratory results include HGB 10 g/dl, HC 30%, platelets 300,000/mm3, international normalized ratio (INR) 1.0, aspartate transaminase (AS) 30 U/L, alanine transaminase (AL) 45 U/L, and albumin 4.0 g/dl. After appropriate resuscitation, he undergoes esophagogastroduodenoscopy (EGO) which is notable for gastric varices. Which of the following is the appropriate treatment for his condition? [2/2024R]",
    "options": [
      "Transjugular intrahepatic portosystemic shunt",
      "Variceal band ligation",
      "Splenorenal shunt",
      "Splenectomy",
      "Esophagectomy"
    ],
    "correctAnswer": "Transjugular intrahepatic portosystemic shunt",
    "explanation": {
      "correct": "Gastric varices, especially when bleeding, are best managed with TIPS (transjugular intrahepatic portosystemic shunt) to decompress portal pressure when endoscopic therapy is inadequate.",
      "incorrect": [
        {"option": "Variceal band ligation", "reason": "Standard for esophageal varices, less effective for gastric varices."},
        {"option": "Splenorenal shunt", "reason": "Older surgical method, reserved for refractory cases."},
        {"option": "Splenectomy", "reason": "Not indicated for variceal bleeding."},
        {"option": "Esophagectomy", "reason": "Irrelevant and inappropriate for varices."}
      ]
    }
  },
  {
    "CaseID": "Emergency_69",
    "case": "A 22-year-old man is stabbed in the right chest with a 5-cm-long knife blade. On arrival at the emergency department, he is awake and alert. He is speaking with a normal tone of voice but complaining of shortness of breath. The right hemithorax is hyper-resonant to percussion and has no breath sounds. The rest of the initial survey is negative. His blood pressure is 110/75 mm Hg pulse is 86 beats/min, and venous pressure is 3 cm H2O. Pulse oximetry shows a saturation of sex. Which of the following is the most appropriate next step in patient care? [2/2024R]",
    "options": [
      "Infusion of 2 L. Ringer's lactate",
      "Securing an airway by orotracheal intubation",
      "Immediate insertion of a needle into the right pleural space",
      "Chest x-ray and insertion of a chest tube",
      "Sonographically guided evacuation of the pericardial sac"
    ],
    "correctAnswer": "Immediate insertion of a needle into the right pleural space",
    "explanation": {
      "correct": "Clinical picture of open or tension pneumothorax—absent breath sounds, hyperresonance, dyspnea—requires immediate needle decompression before confirmatory imaging.",
      "incorrect": [
        {"option": "Infusion of 2 L. Ringer's lactate", "reason": "Not indicated; patient is hemodynamically stable."},
        {"option": "Securing an airway by orotracheal intubation", "reason": "Not the first step unless severe distress or unconsciousness."},
        {"option": "Chest x-ray and insertion of a chest tube", "reason": "Definitive tube follows emergent needle decompression."},
        {"option": "Sonographically guided evacuation of the pericardial sac", "reason": "No signs of tamponade; irrelevant here."}
      ]
    }
  },
  {
    "CaseID": "Emergency_70",
    "case": "A 65-year-old man was brought to the emergency department with sudden-onset of weakness on the right side of the body, slurred speech, and difficulty understanding spoken language that started 2 hours ago. He has a history of hypertension and diabetes. On examination, he has right-sided hemiparesis and facial droop. His blood pressure is elevated, and his blood glucose levels are within normal limits. Based on the presented scenario, which of the following is the most appropriate initial management for this patient? [2/2024R]",
    "options": [
      "Administering tissue plasminogen activator immediately",
      "Performing a non-contrast head CT scan",
      "Ordering a complete blood count and comprehensive metabolic panel",
      "Transferring the patient to the intensive care unit for close monitoring",
      "Initiating antihypertensive therapy to lower blood pressure"
    ],
    "correctAnswer": "Performing a non-contrast head CT scan",
    "explanation": {
      "correct": "Before administering thrombolytic therapy in acute stroke, it is essential to rule out intracerebral hemorrhage by a non-contrast CT scan of the head.",
      "incorrect": [
        {"option": "Administering tissue plasminogen activator immediately", "reason": "Should only be given after excluding hemorrhagic stroke on imaging."},
        {"option": "Ordering a complete blood count and comprehensive metabolic panel", "reason": "These tests are routine but not the immediate next step."},
        {"option": "Transferring the patient to the intensive care unit for close monitoring", "reason": "Monitoring is secondary to immediate diagnostic imaging."},
        {"option": "Initiating antihypertensive therapy to lower blood pressure", "reason": "BP should not be aggressively lowered before excluding stroke type."}
      ]
    }
  },
  {
    "CaseID": "Emergency_71",
    "case": "A 72-year-old man status post-coronary artery bypass graft (CABG) 5 years ago presents with hematochezia, abdominal pain, and fevers. Colonoscopy reveals patches of dusky-appearing mucosa at the splenic flexure without active bleeding. Which of the following is the most appropriate management of this patient? [2/2024R]",
    "options": [
      "Angiography with administration of intra-arterial papaverine",
      "Emergent laparotomy with left hemicolectomy and transverse colostomy",
      "Aortomesenteric bypass",
      "Exploratory laparotomy with thrombectomy of the inferior mesenteric artery",
      "Expectant management"
    ],
    "correctAnswer": "Expectant management",
    "explanation": {
      "correct": "This is ischemic colitis, often transient at watershed areas (splenic flexure). Most cases resolve with supportive care (IV fluids, bowel rest, antibiotics if needed).",
      "incorrect": [
        {"option": "Angiography with administration of intra-arterial papaverine", "reason": "Used for mesenteric ischemia, not ischemic colitis."},
        {"option": "Emergent laparotomy with left hemicolectomy and transverse colostomy", "reason": "Reserved for peritonitis or necrosis."},
        {"option": "Aortomesenteric bypass", "reason": "For chronic mesenteric ischemia, not colonic ischemia."},
        {"option": "Exploratory laparotomy with thrombectomy of the inferior mesenteric artery", "reason": "Not indicated without evidence of embolic occlusion."}
      ]
    }
  },
  {
    "CaseID": "Emergency_72",
    "case": "A 58-year-old woman came to the Emergency Room (ER) for evaluation of a painful left foot. She noticed the pain when she awoke in the morning. She had a history of painful calf muscles when she walks. On examination, she had irregular heartbeats. She had no palpable pulses and no audible Doppler signals in her left foot. The foot was cool to the touch, and there was some decreased sensation at the toes. Which of the following is the next best step in this patient's management? [2/2024R]",
    "options": [
      "An echocardiogram looking for atrial thrombus",
      "Initiation of a heparin infusion",
      "Duplex imaging of her arterial vessels in her left leg looking for acute occlusion",
      "Aortogram with left lower extremity runoff to determine the level of the vascular occlusion",
      "Initiating infusion of thrombolytics to dissolve the clot"
    ],
    "correctAnswer": "Initiation of a heparin infusion",
    "explanation": {
      "correct": "Acute limb ischemia requires immediate systemic anticoagulation with IV heparin to prevent thrombus propagation while further evaluation proceeds.",
      "incorrect": [
        {"option": "An echocardiogram looking for atrial thrombus", "reason": "Useful later to find embolic source, not initial step."},
        {"option": "Duplex imaging of her arterial vessels in her left leg looking for acute occlusion", "reason": "Performed after starting anticoagulation."},
        {"option": "Aortogram with left lower extremity runoff to determine the level of the vascular occlusion", "reason": "Invasive; not done before stabilization."},
        {"option": "Initiating infusion of thrombolytics to dissolve the clot", "reason": "Thrombolytics are considered after imaging confirms occlusion and limb viability."}
      ]
    }
  },
  {
    "CaseID": "Emergency_73",
    "case": "A 30-year-old man is brought to the Emergency Department (ED) after being hit in the head by a baseball. He is making incomprehensible sounds, but no words. He opens his eyes and withdraws to painful stimuli. Which of the following is his Glasgow Coma Scale score? [2/2024R]",
    "options": [
      "10",
      "9",
      "8",
      "7",
      "6"
    ],
    "correctAnswer": "8",
    "explanation": {
      "correct": "Eye opening to pain (2), incomprehensible sounds (2), and withdrawal to pain (4) = total GCS of 8, indicating severe head injury.",
      "incorrect": [
        {"option": "10", "reason": "Would require better verbal or motor response."},
        {"option": "9", "reason": "Higher than calculated based on current responses."},
        {"option": "7", "reason": "Would require less responsiveness."},
        {"option": "6", "reason": "Too low; patient demonstrates purposeful withdrawal."}
      ]
    }
  },
  {
    "CaseID": "Emergency_74",
    "case": "A 39-year-old woman comes to the emergency room because of right upper quadrant pain. She has no significant past medical history and the only medication taken by her is oral contraceptive pills (OCP). CT scan demonstrates a 6-cm hepatic adenoma in the right lobe of the liver. Which of the following describes the definitive treatment of this lesion? [2/2024R]",
    "options": [
      "Cessation of oral contraceptives and serial CT scans",
      "Intra-arterial embolization of the hepatic adenoma",
      "Embolization of the right portal vein",
      "Resection of the hepatic adenoma",
      "Systemic chemotherapy"
    ],
    "correctAnswer": "Resection of the hepatic adenoma",
    "explanation": {
      "correct": "Large hepatic adenomas (>5 cm) carry a high risk of rupture and malignant transformation; surgical resection is definitive management.",
      "incorrect": [
        {"option": "Cessation of oral contraceptives and serial CT scans", "reason": "Suitable for small lesions (<5 cm), not large adenomas."},
        {"option": "Intra-arterial embolization of the hepatic adenoma", "reason": "Used for acute hemorrhage or nonoperative candidates."},
        {"option": "Embolization of the right portal vein", "reason": "Done for hypertrophy before resection, not curative here."},
        {"option": "Systemic chemotherapy", "reason": "No role; adenomas are benign."}
      ]
    }
  },
  {
    "CaseID": "Emergency_75",
    "case": "A 25-year-old woman presents to the emergency room complaining of redness and pain in her right foot up to the level of the midcalf. She reports that her right lower extremity has been swollen for at least 15 years, but her left leg has been normal. On physical examination, she has a temperature of 39°C and the right lower extremity is non-tender with nonpitting edema from the groin down to the foot. There is cellulitis of the right foot without ulcers or skin discoloration. The left leg is normal. Which of the following is the most likely underlying problem? [2/2024R]",
    "options": [
      "Congenital lymphedema",
      "Lymphedema praecox",
      "Venous insufficiency",
      "Deep venous thrombosis",
      "Acute arterial insufficiency"
    ],
    "correctAnswer": "Lymphedema praecox",
    "explanation": {
      "correct": "Lymphedema praecox is the most common form of primary lymphedema, presenting before age 35, usually unilateral, with chronic nonpitting swelling and recurrent cellulitis.",
      "incorrect": [
        {"option": "Congenital lymphedema", "reason": "Appears at birth or infancy, not in adolescence."},
        {"option": "Venous insufficiency", "reason": "Typically bilateral with pitting edema and hyperpigmentation."},
        {"option": "Deep venous thrombosis", "reason": "Would present with tenderness, pain, and acute swelling."},
        {"option": "Acute arterial insufficiency", "reason": "Manifests with pallor, pulselessness, and pain, not chronic edema."}
      ]
    }
  },
  {
    "CaseID": "Emergency_76",
    "case": "A 48-year-old woman develops pain in the right lower quadrant while playing tennis. The pain progresses and the patient presents to the emergency room later that day with a low-grade fever, a WBC count of 13,000/mm3 and complaints of anorexia and nausea as well as persistent, sharp pain of the right lower quadrant. On examination, she is tender in the right lower quadrant with muscular spasm, and there is a suggestion of a mass effect. An ultrasound is ordered and shows an apparent mass in the abdominal wall. Which of the following is the most likely diagnosis? [2/2024R]",
    "options": [
      "Acute appendicitis",
      "Cecal carcinoma",
      "Hematoma of the rectus sheath",
      "Torsion of an ovarian cyst",
      "Cholecystitis"
    ],
    "correctAnswer": "Hematoma of the rectus sheath",
    "explanation": {
      "correct": "Localized abdominal wall tenderness with a palpable mass and ultrasound showing an abdominal wall lesion indicates rectus sheath hematoma, often due to minor trauma or strain.",
      "incorrect": [
        {"option": "Acute appendicitis", "reason": "Would not be localized to the abdominal wall and lacks a defined mass."},
        {"option": "Cecal carcinoma", "reason": "Unlikely in this acute presentation with physical exertion trigger."},
        {"option": "Torsion of an ovarian cyst", "reason": "Pain is pelvic with adnexal tenderness, not abdominal wall mass."},
        {"option": "Cholecystitis", "reason": "Pain would be in RUQ, not RLQ."}
      ]
    }
  },
  {
    "CaseID": "Emergency_77",
    "case": "A 39-year-old woman comes to the emergency department because of right lower quadrant abdominal pain and vaginal spotting. Examination is remarkable for a diffusely tender abdomen with rebound and guarding. Halfway through the examination, the patient begins to complain of shoulder pain. Urine hCG is positive. Transvaginal ultrasound shows nothing in the uterus and significant free fluid in the abdomen and pelvis. Which of the following is the most likely cause of this patient's shoulder pain? [2/2024R]",
    "options": [
      "Atypical chest pain",
      "Diaphragmatic irritation",
      "Pulmonary embolism",
      "Malingering",
      "Rotator cuff tear"
    ],
    "correctAnswer": "Diaphragmatic irritation",
    "explanation": {
      "correct": "Shoulder pain in ruptured ectopic pregnancy results from diaphragmatic irritation by intraperitoneal blood, referred via the phrenic nerve.",
      "incorrect": [
        {"option": "Atypical chest pain", "reason": "Not associated with abdominal bleeding."},
        {"option": "Pulmonary embolism", "reason": "Would cause chest pain and dyspnea, not referred shoulder pain."},
        {"option": "Malingering", "reason": "No evidence; symptoms are physiologic."},
        {"option": "Rotator cuff tear", "reason": "Musculoskeletal, unrelated to intra-abdominal bleeding."}
      ]
    }
  },
  {
    "CaseID": "Emergency_78",
    "case": "A 20-day-old breastfed girl presents to the emergency department with jaundice, vomiting and lethargy. Physical examination reveals significant hepatomegaly. Catheterized urine analysis demonstrates non glucose reducing substances and white blood cells. What is the most likely diagnosis? [8/2024S]",
    "options": [
      "Wilson disease",
      "Galactosemia",
      "Glycogen storage type l",
      "Tyrosinemia",
      "Biliary atresia"
    ],
    "correctAnswer": "Galactosemia",
    "explanation": {
      "correct": "Galactosemia presents in neonates after milk feeding with jaundice, hepatomegaly, vomiting, and reducing substances in urine due to galactose accumulation.",
      "incorrect": [
        {"option": "Wilson disease", "reason": "Presents later in childhood, not in neonates."},
        {"option": "Glycogen storage type l", "reason": "Causes hypoglycemia, not reducing substances in urine."},
        {"option": "Tyrosinemia", "reason": "Causes liver dysfunction but not reducing substances."},
        {"option": "Biliary atresia", "reason": "Presents with acholic stool and conjugated hyperbilirubinemia, not reducing urine sugars."}
      ]
    }
  },
  {
    "CaseID": "Emergency_79",
    "case": "A 67-year-old man presented in emergency ward with history of weakness of right side of body of rapid onset. Which of the following is the most helpful first line investigation for management of this patient? [8/2024R]",
    "options": [
      "Cerebral angiography",
      "Cerebrospinal fluid examination",
      "Computerized tomography scan brain",
      "Fasting lipid profile",
      "Nerve conduction study"
    ],
    "correctAnswer": "Computerized tomography scan brain",
    "explanation": {
      "correct": "Acute onset focal neurological deficit suggests stroke. Non-contrast CT brain is the first-line investigation to differentiate ischemic from hemorrhagic stroke.",
      "incorrect": [
        {"option": "Cerebral angiography", "reason": "Used after CT to evaluate vessels."},
        {"option": "Cerebrospinal fluid examination", "reason": "Not indicated initially in stroke evaluation."},
        {"option": "Fasting lipid profile", "reason": "Used later for risk assessment, not diagnosis."},
        {"option": "Nerve conduction study", "reason": "Used for peripheral neuropathy, not central lesion."}
      ]
    }
  },
  {
    "CaseID": "Emergency_80",
    "case": "A 3-month-old infant is brought to the emergency department for severe vomiting over the past 3 hours. The mother tells this physician that she has vomited at last 4 times during the period. She also noticed the infant was having difficulty feeding for 2 days. On examination, she is very fussy, and there is a swelling over the left side of the head. CT of the head shows a skull fracture of the left parietal bone with no evidence of intracranial damage. The mother explains that the baby rolled off the sofa onto the floor yesterday. Which of the following is the most appropriate next step in management? [8/2024R]",
    "options": [
      "Discharge the patient home with instructions concerning postconcussion symptoms",
      "Monitoring the infant for 12 hours for signs of increased intracranial pressure, then discharging her if asymptomatic thereafter",
      "Obtaining a skeletal survey",
      "Obtaining a neurosurgical consultation for the skull fracture",
      "Repeating the CT scan of the head in 24 hours"
    ],
    "correctAnswer": "Obtaining a skeletal survey",
    "explanation": {
      "correct": "In infants with suspicious injury inconsistent with history (e.g., skull fracture from low fall), non-accidental trauma must be suspected. Skeletal survey is indicated to detect other fractures.",
      "incorrect": [
        {"option": "Discharge the patient home with instructions concerning postconcussion symptoms", "reason": "Unsafe; possible child abuse requires investigation."},
        {"option": "Monitoring the infant for 12 hours for signs of increased intracranial pressure, then discharging her if asymptomatic thereafter", "reason": "Does not address suspicion of abuse."},
        {"option": "Obtaining a neurosurgical consultation for the skull fracture", "reason": "Fracture is minor; main concern is abuse."},
        {"option": "Repeating the CT scan of the head in 24 hours", "reason": "Not indicated without neurological deterioration."}
      ]
    }
  },
  {
    "CaseID": "Emergency_81",
    "case": "A 2-year-old girl with a ventricular septal defect (VSD) presents to the emergency department after a 15-minute focal seizure of her left arm and leg. A brief history reveals that the child has no known seizure disorders and has been having a low-grade fever at home for about 4 days. She also has been less active and has had poor appetite. On physical examination, her temperature is 40.2°C, and her pulse is 82 beat/min. She is not responsive to her name, but she is responsive to painful stimuli with withdrawal of her extremities. Cardiac examination is significant for a grade 3 systolic murmur best heard at the left lower sternal border. Neurologic examination reveals anisocoria with a dilated right pupil. After stabilization, which of the following is the most appropriate next step in diagnosis? [8/2024R]",
    "options": [
      "ECG",
      "CT of the brain",
      "EEG",
      "Cardiac catheterization",
      "Lumbar puncture"
    ],
    "correctAnswer": "CT of the brain",
    "explanation": {
      "correct": "Child with congenital heart disease (VSD) and new focal seizure with anisocoria suggests brain abscess or hemorrhage. CT brain is the best initial diagnostic step before LP.",
      "incorrect": [
        {"option": "ECG", "reason": "Not helpful in evaluating neurological causes of seizure or anisocoria."},
        {"option": "EEG", "reason": "Used after structural causes are excluded; not initial in acute focal seizure."},
        {"option": "Cardiac catheterization", "reason": "Not indicated; cardiac cause is already known."},
        {"option": "Lumbar puncture", "reason": "Contraindicated before imaging due to risk of herniation with mass effect."}
      ]
    }
  },
  {
    "CaseID": "Emergency_82",
    "case": "A 76-year-old man is brought to the hospital with persistent diarrhea and vomiting for the past 4 days. He has been unable to keep his food down and feels very tired. On examination he is very dehydrated. His pulse is 128/min and his BP is 88/52 mmHg. Which of the following is the most likely diagnosis? [8/2024R]",
    "options": [
      "Septic shock",
      "Cardiogenic shock",
      "Hypovolemic shock",
      "Neurogenic shock",
      "Anaphylactic shock"
    ],
    "correctAnswer": "Hypovolemic shock",
    "explanation": {
      "correct": "Severe dehydration due to vomiting and diarrhea leads to fluid loss and decreased circulating volume — classic hypovolemic shock with tachycardia and hypotension.",
      "incorrect": [
        {"option": "Septic shock", "reason": "Would present with fever, warm skin, and elevated WBC count."},
        {"option": "Cardiogenic shock", "reason": "Occurs due to pump failure, not dehydration."},
        {"option": "Neurogenic shock", "reason": "Typically due to spinal cord injury with bradycardia and hypotension."},
        {"option": "Anaphylactic shock", "reason": "Associated with allergic reaction signs — rash, bronchospasm."}
      ]
    }
  },
  {
    "CaseID": "Emergency_83",
    "case": "A 10-year-old was brought to the emergency hospital after blunt abdominal trauma. He was haemodynamically stable on presentation. Bruises were found in upper abdomen. Which of the following is the first investigation to be done to exclude solid organ injury? [8/2024R]",
    "options": [
      "Abdominal CT scan",
      "Abdominal MRI",
      "Abdominal US",
      "Plain x-ray abdomen erect",
      "Angiography"
    ],
    "correctAnswer": "Abdominal US",
    "explanation": {
      "correct": "Focused Assessment with Sonography for Trauma (FAST) is the first-line imaging to detect intra-abdominal fluid or solid organ injury in stable trauma patients.",
      "incorrect": [
        {"option": "Abdominal CT scan", "reason": "Used after FAST or if US is inconclusive."},
        {"option": "Abdominal MRI", "reason": "Not used in acute trauma settings."},
        {"option": "Plain x-ray abdomen erect", "reason": "Detects perforation, not soft tissue injury."},
        {"option": "Angiography", "reason": "Reserved for active bleeding localization after diagnosis."}
      ]
    }
  },
  {
    "CaseID": "Emergency_84",
    "case": "A 29-year-old Gravida 2 Para 2 woman at 33 weeks' gestation presents to the emergency department with a 24-hour history of increasing acute abdominal pain as severe with radiation from the epigastrium to the back and had two episodes of vomiting. On examination, the patient appears acutely ill and is lying on the bed with her knees drawn up. Her blood pressure is 100/70 mmHg, pulse is 110 beats/minute, and temperature is 38.8°C. Her abdomen is somewhat distended and tender, mainly in the epigastric area, and the uterine fundus is not tender. Hypotonic bowel sounds are noted. CTG is reassuring without uterine contractions. Laboratory values show mild leukocytosis (12,000 cells/ml), Hb 11 gm/dl, mildly elevated serum AST and ALT, and serum amylase of 180 U/dl. Urinalysis is normal. Which of the following the most likely diagnosis? [8/2024R]",
    "options": [
      "Gastroenteritis",
      "Acute cholecystitis",
      "Acute pancreatitis",
      "Acute appendicitis",
      "Severe preeclampsia"
    ],
    "correctAnswer": "Acute pancreatitis",
    "explanation": {
      "correct": "Severe epigastric pain radiating to the back with elevated amylase in a pregnant woman strongly indicates acute pancreatitis, often due to gallstones or hyperlipidemia.",
      "incorrect": [
        {"option": "Gastroenteritis", "reason": "Usually causes diarrhea and diffuse pain, not elevated amylase."},
        {"option": "Acute cholecystitis", "reason": "Pain localized to right upper quadrant, not radiating to back."},
        {"option": "Acute appendicitis", "reason": "Pain is localized to right iliac fossa, not epigastric."},
        {"option": "Severe preeclampsia", "reason": "Associated with hypertension and proteinuria, absent here."}
      ]
    }
  },
  {
    "CaseID": "Emergency_85",
    "case": "A 22-year-old woman with type 1 diabetes presents to the emergency department with anorexia, nausea, vomiting, and abdominal pain. She is recovering from pneumonia and has had much difficulty regulating her blood sugars lately. On arrival to the emergency department her blood glucose is 760 mg/dl, sodium is 125 mEq/l, potassium is 4.0 mEq/l, bicarbonate is 12 mEq/l, chloride is 92 mEq/L, and her blood is positive for ketones by acetone screening. Which of the following is the most appropriate initial step in management? [8/2024R]",
    "options": [
      "Broad coverage antibiotic therapy",
      "IV glucose and insulin",
      "IV hypertonic saline",
      "IV potassium",
      "IV saline and insulin"
    ],
    "correctAnswer": "IV saline and insulin",
    "explanation": {
      "correct": "Classic presentation of diabetic ketoacidosis — first-line management is IV fluid resuscitation with normal saline followed by insulin therapy.",
      "incorrect": [
        {"option": "Broad coverage antibiotic therapy", "reason": "May be needed if infection is suspected but not the immediate step."},
        {"option": "IV glucose and insulin", "reason": "Glucose is added only after blood glucose drops below 250 mg/dL."},
        {"option": "IV hypertonic saline", "reason": "Not indicated; isotonic saline is used for volume restoration."},
        {"option": "IV potassium", "reason": "Potassium is given only once urine output is adequate and K+ falls."}
      ]
    }
  },
  {
    "CaseID": "Emergency_86",
    "case": "A 22-year-old man is seen in The Emergency Department with a 2-day history of right iliac fossa pain, anorexia, vomiting and diarrhea. On examination the patient is flushed and tachycardic (pulse 100/min). Abdominal examination demonstrates the presence of tenderness and guarding in the right iliac fossa with no masses palpable. What is your provisional diagnosis? [5/2022M_8/2024R]",
    "options": [
      "Acute appendicitis",
      "Diverticulitis",
      "Gastroenteritis",
      "Irritable bowel syndrome",
      "Ureteric colic"
    ],
    "correctAnswer": "Acute appendicitis",
    "explanation": {
      "correct": "Classic symptoms of anorexia, vomiting, and right iliac fossa tenderness with guarding point toward acute appendicitis.",
      "incorrect": [
        {"option": "Diverticulitis", "reason": "Usually left-sided pain, not right iliac fossa."},
        {"option": "Gastroenteritis", "reason": "Typically has diffuse pain and no localized tenderness."},
        {"option": "Irritable bowel syndrome", "reason": "Does not cause fever or guarding."},
        {"option": "Ureteric colic", "reason": "Severe colicky pain radiating to groin, not localized RLQ tenderness."}
      ]
    }
  },
  {
    "CaseID": "Emergency_87",
    "case": "A 70-year-old woman attends The Emergency Department having fallen at home. She is unclear of the events surrounding the fall, and as she lives alone, no collateral history is available. She has vomited three times since arrival in the department. Her Glasgow Coma Scale (GCS) is currently 15. All other observations are normal. There is no evidence of focal neurological deficit. What is your next step of management? [5/2022M_8/2024R]",
    "options": [
      "Admit for neuro-observations",
      "Computed tomography (CT scan Head)",
      "Craniotomy",
      "Discharge",
      "Elective burr hole"
    ],
    "correctAnswer": "Admit for neuro-observations",
    "explanation": {
      "correct": "Elderly patient with head trauma and vomiting should be admitted for observation even with normal GCS, due to risk of delayed intracranial bleed.",
      "incorrect": [
        {"option": "Computed tomography (CT scan Head)", "reason": "May be done if deterioration occurs or risk factors present."},
        {"option": "Craniotomy", "reason": "Not indicated without imaging evidence of hematoma."},
        {"option": "Discharge", "reason": "Unsafe without observation period."},
        {"option": "Elective burr hole", "reason": "Only for confirmed chronic subdural hematoma."}
      ]
    }
  },
  {
    "CaseID": "Emergency_88",
    "case": "A 4-year-old child presents to the Emergency Department with fever 40°C, headache and two attacks of convulsions over the past two hours. Examination shows he is irritable and has neck rigidity. His mother states he had fever 38°C and mild nasal discharge. What is the most appropriate investigation done? [10/2021T_6/2023R_11/2023T_11/2023S_2/2024T_2/2024S_8/2024T_8/2024S]",
    "options": [
      "CT head",
      "Lumbar puncture",
      "Blood picture",
      "Blood culture",
      "Serum electrolytes"
    ],
    "correctAnswer": "Lumbar puncture",
    "explanation": {
      "correct": "Child with fever, seizures, and neck stiffness suggests meningitis. Lumbar puncture is essential for CSF analysis and confirmation.",
      "incorrect": [
        {"option": "CT head", "reason": "Indicated only if signs of raised intracranial pressure are present."},
        {"option": "Blood picture", "reason": "Nonspecific; does not confirm meningitis."},
        {"option": "Blood culture", "reason": "Adjunctive, not diagnostic alone."},
        {"option": "Serum electrolytes", "reason": "May identify complications but not the cause."}
      ]
    }
  },
  {
    "CaseID": "Emergency_89",
    "case": "A teenage boy falls from his bicycle and is run over by a truck. On arrival in the emergency room (ER), he is awake and alert and appears frightened but in no distress. The chest radiograph suggests an air-fluid level in the left lower lung field and the nasogastric tube seems to coil upward into the left chest. Which of the following is the next best step in his management? [2/2024R]",
    "options": [
      "Placement of a left chest tube",
      "Thoracotomy",
      "Laparotomy",
      "Esophagogastroscopy",
      "Diagnostic peritoneal lavage"
    ],
    "correctAnswer": "Laparotomy",
    "explanation": {
      "correct": "Air-fluid level and nasogastric tube in chest indicate diaphragmatic rupture with herniation of stomach — requires surgical repair via laparotomy.",
      "incorrect": [
        {"option": "Placement of a left chest tube", "reason": "May injure herniated viscera and worsen condition."},
        {"option": "Thoracotomy", "reason": "Approach used if thoracic injury predominates, not here."},
        {"option": "Esophagogastroscopy", "reason": "Not diagnostic or therapeutic for diaphragmatic rupture."},
        {"option": "Diagnostic peritoneal lavage", "reason": "Obsolete; imaging and clinical findings are diagnostic."}
      ]
    }
  },
  {
    "CaseID": "Emergency_90",
    "case": "A 60-year-old woman has had a 6 month history of bloody diarrhea. She presents to the ER with severe abdominal pain and constipation. On examination, her abdomen is distended and tender on the left side. Rectal examination reveals small amount of feces. Blood tests show Hb 11.0 g/dl TLC 15.6 x 10^9/L, platelets 450 x 10^9/L Sodium is 139 mmol/L, potassium 4.6 mmol/L, urea 25 mg/dl, creatinine 1.3 mg/dl and CRP 75 mg/L. What is the next best further investigation? [11/2022R_1/2023M_6/2023S_6/2023R_11/2023R_8/2024S]",
    "options": [
      "Colonoscopy",
      "CT of the abdomen",
      "Magnetic resonance imaging (MRI) of abdomen",
      "Sigmoidoscopy",
      "X ray of abdomen"
    ],
    "correctAnswer": "X ray of abdomen",
    "explanation": {
      "correct": "In suspected toxic megacolon, the first step is plain abdominal X-ray to assess for colonic dilatation before invasive procedures.",
      "incorrect": [
        {"option": "Colonoscopy", "reason": "Contraindicated in acute distension; risk of perforation."},
        {"option": "CT of the abdomen", "reason": "Useful after X-ray if diagnosis uncertain."},
        {"option": "Magnetic resonance imaging (MRI) of abdomen", "reason": "Not used acutely."},
        {"option": "Sigmoidoscopy", "reason": "Avoided in acute colonic dilatation."}
      ]
    }
  },
  {
    "CaseID": "Emergency_91",
    "case": "A 25-year-old patient presents with a 7 month history of bloody diarrhea. She is brought to the ER with severe abdominal pain and constipation. On examination, the abdomen is bloated and tender on the left side. PR examination shows small amount of feces. Blood tests shows Hb 10.0 g/dl TLC 16.8 x 10^9/L, platelets 440 x 10^9/L. Sodium 138 mmol/L, potassium 4.6 mmol/L, urea 25 mg/dl, creatinine 1.3 mg/dl and CRP 75 mg/L. Which of the following is the next step for diagnosis? [11/2022R]",
    "options": [
      "Colonoscopy",
      "CT of the abdomen",
      "Magnetic resonance imaging (MRI) of abdomen",
      "Sigmoidoscopy",
      "X ray of abdomen"
    ],
    "correctAnswer": "X ray of abdomen",
    "explanation": {
      "correct": "Same presentation as previous question — suggests toxic megacolon secondary to inflammatory bowel disease. Plain abdominal X-ray is first to confirm dilation before any endoscopy.",
      "incorrect": [
        {"option": "Colonoscopy", "reason": "Dangerous due to risk of perforation."},
        {"option": "CT of the abdomen", "reason": "Used if diagnosis remains uncertain after X-ray."},
        {"option": "Magnetic resonance imaging (MRI) of abdomen", "reason": "Not first-line in emergency."},
        {"option": "Sigmoidoscopy", "reason": "Contraindicated in acute dilation."}
      ]
    }
  },
  {
    "CaseID": "Emergency_92",
    "case": "A 65-year-old man presents to ER with fever, rigors and upper abdominal pain for one day, not improving with analgesics. On examination, his temp 38°C, pulse 120/min and BP 130/85mmHg. He is jaundiced. Lab tests were WBC 21,000/L, AST 68 IU/L, ALP 442 IU/L, bilirubin 4.3 mg/L. What is the most likely diagnosis? [10/2021T_6/2023R]",
    "options": [
      "Post phlebitic syndrome",
      "Cellulitis",
      "Arteriovenous fistula",
      "Hypoproteinemia",
      "Lymphatic obstruction"
    ],
    "correctAnswer": "Cellulitis",
    "explanation": {
      "correct": "Fever, rigors, leukocytosis, and localized tenderness indicate cellulitis — an acute bacterial skin and soft tissue infection.",
      "incorrect": [
        {"option": "Post phlebitic syndrome", "reason": "A chronic venous condition that causes edema and skin changes but no fever or leukocytosis."},
        {"option": "Arteriovenous fistula", "reason": "Characterized by continuous bruit and high-output heart failure, not infection signs."},
        {"option": "Hypoproteinemia", "reason": "Causes generalized edema but not pain, erythema, or systemic infection."},
        {"option": "Lymphatic obstruction", "reason": "Presents as chronic non-pitting edema without systemic symptoms."}
      ]
    }
  },
  {
    "CaseID": "Emergency_93",
    "case": "A 35 year-old man presents to the ER with acute onset of right groin pain, nausea, and vomiting. The symptoms occurred after he tried to lift a heavy box. Physical examination shows abdominal distension and a right groin mass that is tender to palpation. What is the most appropriate management for this patient? [11/2020T_11/2022R_11/2023S_8/2024T]",
    "options": [
      "Prescribe ibuprofen for pain and ask him to see his primary physician the following day",
      "Attempt to reduce the hernia and then discharge home",
      "Premedicate the patient attempt to reduce the hernia, and then instruct him to never lift heavy boxes",
      "Premedicate the patient attempt to reduce the hernia and then scheduled for an elective hernia repair",
      "Surgical evaluation for an emergency repair"
    ],
    "correctAnswer": "Surgical evaluation for an emergency repair",
    "explanation": {
      "correct": "The patient has features of incarcerated or strangulated inguinal hernia (painful, tender, irreducible mass with vomiting and distension). This is a surgical emergency requiring immediate evaluation and repair.",
      "incorrect": [
        {"option": "Prescribe ibuprofen for pain and ask him to see his primary physician the following day", "reason": "Delays treatment of possible strangulation, risking bowel necrosis."},
        {"option": "Attempt to reduce the hernia and then discharge home", "reason": "Manual reduction without anesthesia may cause rupture or reduction en masse."},
        {"option": "Premedicate the patient attempt to reduce the hernia, and then instruct him to never lift heavy boxes", "reason": "Reduction should only be attempted in non-strangulated hernias."},
        {"option": "Premedicate the patient attempt to reduce the hernia and then scheduled for an elective hernia repair", "reason": "Elective repair applies to reducible hernias, not tender ones with obstruction."}
      ]
    }
  },
  {
    "CaseID": "Emergency_94",
    "case": "A 55-year-old man presents to the ED with a sudden onset, severe right sided abdominal pain. The pain is sharp and intermittent, and is felt worse in the right iliac fossa/right groin region. On examination, his abdomen is soft. What is the most likely diagnosis? [12/2020T_12/2021T_2/2024S]",
    "options": [
      "Ruptured ovarian cyst",
      "Crohn’s disease",
      "Acute appendicitis",
      "Ureteric colic",
      "Cecal adenocarcinoma"
    ],
    "correctAnswer": "Ureteric colic",
    "explanation": {
      "correct": "Severe, sharp, intermittent flank-to-groin pain with a soft abdomen is typical of ureteric colic caused by a renal stone moving along the ureter.",
      "incorrect": [
        {"option": "Ruptured ovarian cyst", "reason": "Occurs in females, not applicable here."},
        {"option": "Crohn’s disease", "reason": "Causes chronic pain and diarrhea, not acute colicky pain."},
        {"option": "Acute appendicitis", "reason": "Produces localized tenderness and peritonism, not intermittent pain."},
        {"option": "Cecal adenocarcinoma", "reason": "Chronic presentation with mass and altered bowel habits, not sudden pain."}
      ]
    }
  },
  {
    "CaseID": "Emergency_95",
    "case": "Thirty years old patient comes to the ER complaining of palpitation for the last 2 hours. On examination, pulse is 180 b/min. with irregular irregularity sweaty BP 80/50, bilateral lower limb edema. Which of the following is the most likely suitable line of treatment? [1/2021T_10/2021T_1/2023M_6/2023S_2/2024S]",
    "options": [
      "DC shock",
      "Digitalis",
      "Calcium channel blocker",
      "IV frusemide",
      "Beta Blockers"
    ],
    "correctAnswer": "DC shock",
    "explanation": {
      "correct": "Irregularly irregular pulse with hypotension and heart failure symptoms suggests atrial fibrillation with hemodynamic instability — immediate synchronized DC cardioversion is indicated.",
      "incorrect": [
        {"option": "Digitalis", "reason": "Useful for rate control in stable AF, not in acute hypotension."},
        {"option": "Calcium channel blocker", "reason": "May worsen hypotension."},
        {"option": "IV frusemide", "reason": "Manages pulmonary edema but not arrhythmia."},
        {"option": "Beta Blockers", "reason": "Contraindicated in acute decompensation with low BP."}
      ]
    }
  },
  {
    "CaseID": "Emergency_96",
    "case": "A 35-year-old woman presents to the ER complaining of palpitation of 2 days duration. Clinical examination revealed: radial pulse is 120 b/min. irregularly irregular, BP 80/50, sweaty. Cardiac auscultation revealed apical beats are 170 b/min. irregular with variable intensity of 1st heart sound and no audible murmur. Which of the following is the appropriate treatment? [5/2022M_11/2023S_11/2023R_2/2024S_8/2024T_8/2024R]",
    "options": [
      "B-Blockers",
      "Calcium channel blockers",
      "Digitalis",
      "ACE-I",
      "D.C shock"
    ],
    "correctAnswer": "D.C shock",
    "explanation": {
      "correct": "The patient has atrial fibrillation with hypotension and poor perfusion, indicating hemodynamic instability — synchronized DC cardioversion is the treatment of choice.",
      "incorrect": [
        {"option": "B-Blockers", "reason": "Used for rate control in stable AF, contraindicated in hypotension."},
        {"option": "Calcium channel blockers", "reason": "Can further lower BP."},
        {"option": "Digitalis", "reason": "Too slow in unstable arrhythmia."},
        {"option": "ACE-I", "reason": "Has no role in acute AF management."}
      ]
    }
  },
  {
    "CaseID": "Emergency_97",
    "case": "A 70 years old man is admitted to the ER with acute upper GI hemorrhage following a bout of repeated vomiting. Fiber optic gastroscopy reveals 3 linear mucosal tears at the gastroesophageal junction, which of the following is most likely diagnosis? [10/2021T_1/2023M_6/2023S_2/2024T_8/2024S]",
    "options": [
      "Scleroderma",
      "Carcinoma of the esophagus",
      "Mallory wise tear",
      "Barret's esophagus",
      "GERD"
    ],
    "correctAnswer": "Mallory wise tear",
    "explanation": {
      "correct": "Linear mucosal lacerations at the gastroesophageal junction after repeated vomiting are diagnostic of Mallory-Weiss tear, a common cause of upper GI bleeding.",
      "incorrect": [
        {"option": "Scleroderma", "reason": "Causes dysphagia due to fibrosis, not mucosal tear."},
        {"option": "Carcinoma of the esophagus", "reason": "Presents with progressive dysphagia, not acute bleeding."},
        {"option": "Barret's esophagus", "reason": "Premalignant condition from chronic reflux, not acute tears."},
        {"option": "GERD", "reason": "Causes reflux symptoms but not linear bleeding tears."}
      ]
    }
  },
  {
    "CaseID": "Emergency_98",
    "case": "Which of the following is a clinical manifestation of anaphylaxis? [1/2023M_6/2023S]",
    "options": [
      "cough",
      "Hypotension",
      "hypertension",
      "cold skin",
      "sore threat"
    ],
    "correctAnswer": "Hypotension",
    "explanation": {
      "correct": "Anaphylaxis causes distributive shock from widespread vasodilation, leading to hypotension — a key clinical hallmark.",
      "incorrect": [
        {"option": "cough", "reason": "Nonspecific symptom; not diagnostic of anaphylaxis."},
        {"option": "hypertension", "reason": "Opposite of expected vasodilatory effect."},
        {"option": "cold skin", "reason": "Usually warm and flushed in early anaphylaxis."},
        {"option": "sore threat", "reason": "Likely a typo for sore throat; may occur but not diagnostic for shock."}
      ]
    }
  },
  {
    "CaseID": "Emergency_99",
    "case": "A 21 year-old male patient is brought to the ER by ambulance with a stab wound to the right upper quadrant (RUQ) of the abdomen. A FAST scan shows free fluid, and the patient is taken to the operating room for an exploratory laparotomy. The findings are a non-bleeding laceration of the right lobe of the liver and a gallbladder laceration. Which of the following is TRUE? [10/2020T_11/2022R]",
    "options": [
      "The gallbladder injury can be treated with cholecystectomy.",
      "Isolated gallbladder injuries are uncommon.",
      "Bile is usually sterile.",
      "The liver laceration does not require closed suction drainage",
      "A thorough exploration is not necessary if the bleeding is confined to the RUQ"
    ],
    "correctAnswer": "The gallbladder injury can be treated with cholecystectomy.",
    "explanation": {
      "correct": "Gallbladder lacerations are managed by cholecystectomy, as repair is difficult and carries risk of bile leakage. Associated liver laceration can be managed conservatively if non-bleeding.",
      "incorrect": [
        {"option": "Isolated gallbladder injuries are uncommon.", "reason": "True statement, but not the direct management answer."},
        {"option": "Bile is usually sterile.", "reason": "Not always true; bile contamination risk exists."},
        {"option": "The liver laceration does not require closed suction drainage", "reason": "Drainage may still be required depending on bile leak or oozing."},
        {"option": "A thorough exploration is not necessary if the bleeding is confined to the RUQ", "reason": "Exploration is always required to assess associated injuries."}
      ]
    }
  },
  {
    "CaseID": "Emergency_100",
    "case": "Melad is 9 years old presented to the ER with severe pallor and dark urine and yellowish discoloration of the sclera. His mum is very worried; he was sick one week ago and took sulphonamides. What is your most probable diagnosis? [10/2021T_11/2022R]",
    "options": [
      "G6PD",
      "Hepatitis A",
      "GE",
      "Typhoid",
      "SLE"
    ],
    "correctAnswer": "G6PD",
    "explanation": {
      "correct": "Acute hemolysis with pallor, jaundice, and dark urine after sulfa drug exposure strongly suggests G6PD deficiency crisis.",
      "incorrect": [
        {"option": "Hepatitis A", "reason": "Causes jaundice but no dark urine or hemolysis after drugs."},
        {"option": "GE", "reason": "Gastroenteritis causes diarrhea and dehydration, not jaundice."},
        {"option": "Typhoid", "reason": "Presents with fever and abdominal pain, not acute hemolysis."},
        {"option": "SLE", "reason": "Chronic autoimmune disease; not drug-induced acute hemolysis."}
      ]
    }
  },
  {
    "CaseID": "Emergency_101",
    "case": "Omar, 12 years old patient, presents to the ER with severe vomiting, pallor and dark urine with some yellowish discoloration of the sclera. His mum is worried on him; he was sick one week ago yet again he ate from street food. What is your most probable diagnosis? [10/2021T_11/2022R]",
    "options": [
      "G6PD",
      "Hepatitis A",
      "Typhoid",
      "Hemophilia",
      "Biliary obstruction"
    ],
    "correctAnswer": "Hepatitis A",
    "explanation": {
      "correct": "Child with jaundice, vomiting, and recent food exposure suggests acute viral hepatitis A — transmitted by fecal-oral route.",
      "incorrect": [
        {"option": "G6PD", "reason": "No drug trigger or acute hemolysis signs described."},
        {"option": "Typhoid", "reason": "Presents with fever, not isolated jaundice."},
        {"option": "Hemophilia", "reason": "Bleeding disorder, not hepatic or jaundiced illness."},
        {"option": "Biliary obstruction", "reason": "Typically painless jaundice and pale stools, not acute systemic illness."}
      ]
    }
  },
  {
    "CaseID": "Emergency_102",
    "case": "A 9 months old child presents to ER department with croup. On examination he has marked stridor at rest and a barking cough, which of the following should this baby be treated with? [2/2023R_6/2023S_2/2024R]",
    "options": [
      "intramuscular adrenaline",
      "intravenous antibiotics",
      "Nebulized adrenaline and oral dexamethasone",
      "Nebulized salbutamol",
      "antibiotics"
    ],
    "correctAnswer": "Nebulized adrenaline and oral dexamethasone",
    "explanation": {
      "correct": "Severe croup with stridor at rest requires nebulized racemic (or L-) adrenaline to reduce airway edema plus oral dexamethasone to prevent recurrence.",
      "incorrect": [
        {"option": "intramuscular adrenaline", "reason": "Used for anaphylaxis, not croup."},
        {"option": "intravenous antibiotics", "reason": "Croup is viral, not bacterial."},
        {"option": "Nebulized salbutamol", "reason": "For lower airway diseases like asthma, not croup."},
        {"option": "antibiotics", "reason": "Ineffective against viral etiology."}
      ]
    }
  },
  {
    "CaseID": "Emergency_103",
    "case": "A 40-year-old woman is brought to ER 3 hours following the abrupt onset of severe deep epigastric pain, nausea, and vomiting. The pain is steady and radiates to the back. The patient is agitated and has cool, clammy skin. Her temperature is 38.5°C, BP is 100/70 mm Hg, pulse is 110/min, and RR are 22/min. Abdominal exam reveals tenderness in the upper abdomen, without guarding. A plain x-ray film shows an air-filled intestinal loop in the left upper quadrant. Abdominal sonography shows multiple gall stones without dilatation of bile ducts. Laboratory investigations show: fasting glucose 150 mg/dL, ALT 90u/l, AST 80 u/l, Amylase 620 U/l, Lipase 510 u/l. Which of the following is the most likely diagnosis? [5/2022M_2/2023R_11/2023S_11/2023R_2/2024S_8/2024T_8/2024R]",
    "options": [
      "Acute cholecystitis",
      "Acute hepatitis",
      "Acute pancreatitis",
      "Bowel perforation",
      "Mesenteric ischemia"
    ],
    "correctAnswer": "Acute pancreatitis",
    "explanation": {
      "correct": "Severe epigastric pain radiating to the back, elevated amylase/lipase, and gallstones on ultrasound confirm acute pancreatitis likely secondary to gallstones.",
      "incorrect": [
        {"option": "Acute cholecystitis", "reason": "Pain localizes to RUQ, not radiating to back; amylase/lipase are normal."},
        {"option": "Acute hepatitis", "reason": "Presents with jaundice and very high ALT/AST but not raised pancreatic enzymes."},
        {"option": "Bowel perforation", "reason": "Would show free air under diaphragm and peritonitis signs."},
        {"option": "Mesenteric ischemia", "reason": "Causes severe pain out of proportion to exam, not elevated lipase."}
      ]
    }
  },
  {
    "CaseID": "Emergency_104",
    "case": "A normally fit and healthy 68-year-old man presented to ER after a sudden collapse in the street with sudden onset back pain. On examination he was hypotensive and a palpable pulsatile expansile epigastric mass was found, and a diagnosis of ruptured abdominal aortic aneurysm was made. What is the treatment for ruptured AAA? [12/2020T_1/2021T_10/2021T_11/2023T]",
    "options": [
      "Do nothing",
      "High flow oxygen",
      "Open surgical repair",
      "IV opioid analgesia",
      "IV fluids"
    ],
    "correctAnswer": "Open surgical repair",
    "explanation": {
      "correct": "Ruptured AAA is a surgical emergency requiring immediate open repair to control hemorrhage and restore circulation.",
      "incorrect": [
        {"option": "Do nothing", "reason": "Fatal without urgent intervention."},
        {"option": "High flow oxygen", "reason": "Supportive but not definitive."},
        {"option": "IV opioid analgesia", "reason": "Used for pain but does not address rupture."},
        {"option": "IV fluids", "reason": "Given cautiously but definitive management is surgery."}
      ]
    }
  },
  {
    "CaseID": "Emergency_105",
    "case": "A 47-year-old male presented to ER by acute abdominal pain & distension, vomiting and constipation for 4 days. The patient gives history of surgery 5 years ago for excision of abdominal mass which was benign. There is history of similar manifestations 1 & 3 years after operation. X-ray, U/S and CT detect dilated bowel loops only. The etiology is most probably: [12/2020T_12/2021T_11/2023T]",
    "options": [
      "Recurrence of the tumor",
      "Bowel ischemia",
      "Adhesive intestinal obstruction",
      "Cancer colon",
      "Cancer stomach"
    ],
    "correctAnswer": "Adhesive intestinal obstruction",
    "explanation": {
      "correct": "Previous abdominal surgery with recurrent obstruction episodes strongly suggests adhesions causing intestinal obstruction.",
      "incorrect": [
        {"option": "Recurrence of the tumor", "reason": "The mass was benign; recurrence is unlikely."},
        {"option": "Bowel ischemia", "reason": "Would cause severe pain, peritonitis, and metabolic acidosis."},
        {"option": "Cancer colon", "reason": "Would present progressively, not intermittently post-surgery."},
        {"option": "Cancer stomach", "reason": "Unrelated to past surgery and causes upper GI symptoms."}
      ]
    }
  },
  {
    "CaseID": "Emergency_106",
    "case": "A 60-year-old diabetic man presented to the ER by central chest pain at rest of 4 hours duration. Clinical examination revealed pulse 100 b/min regular, BP 100/60. Chest and cardiac examination are unremarkable. ECG showed regular sinus rhythm without ST elevation. Which of the following is the most suitable investigation to reveal the diagnosis? [5/2022M_11/2023S_11/2023R_2/2024S_8/2024T_8/2024R]",
    "options": [
      "Chest X-ray",
      "Arterial blood gas",
      "Serum troponin",
      "D-dimer",
      "Echocardiography"
    ],
    "correctAnswer": "Serum troponin",
    "explanation": {
      "correct": "Normal ECG does not exclude NSTEMI. Serum troponin is the most specific marker for myocardial injury.",
      "incorrect": [
        {"option": "Chest X-ray", "reason": "Useful for pulmonary causes but not for ischemic heart disease."},
        {"option": "Arterial blood gas", "reason": "Used for respiratory failure assessment."},
        {"option": "D-dimer", "reason": "Used for suspected PE, not chest pain due to MI."},
        {"option": "Echocardiography", "reason": "Assesses wall motion but troponin confirms myocardial necrosis."}
      ]
    }
  },
  {
    "CaseID": "Emergency_107",
    "case": "The parents of an 18-month-old girl bring her to the ER after she had a seizure. They reported she was healthy, temperature 39.5°C. She is oriented and playing now. Which of the following suggests the good outcome of her condition? [11/2023R_2/2024R_8/2024R]",
    "options": [
      "CSF cells 100 WBCs",
      "Otitis media examination",
      "The seizure lasted 30 minutes",
      "The seizure was focal affecting one side",
      "The seizure recurred 3 times before ER"
    ],
    "correctAnswer": "Otitis media examination",
    "explanation": {
      "correct": "A simple febrile seizure associated with otitis media has excellent prognosis with no neurologic sequelae.",
      "incorrect": [
        {"option": "CSF cells 100 WBCs", "reason": "Suggests meningitis, not benign febrile seizure."},
        {"option": "The seizure lasted 30 minutes", "reason": "Prolonged duration indicates complex seizure."},
        {"option": "The seizure was focal affecting one side", "reason": "Focal features indicate complex type."},
        {"option": "The seizure recurred 3 times", "reason": "Recurrent seizures suggest higher risk of epilepsy."}
      ]
    }
  },
  {
    "CaseID": "Emergency_108",
    "case": "A 65-year-old diabetic man comes to the ER complaining of recurrent retrosternal chest pain radiating to the shoulder. The pain increases with exertion and improves with rest. His blood pressure is 150/90 mmHg. Which of the following is the next step to diagnose the cause of his symptom? [2/2024R]",
    "options": [
      "ECG",
      "Chest X-ray",
      "Echocardiography",
      "Serum troponin",
      "Cardiac catheterization"
    ],
    "correctAnswer": "ECG",
    "explanation": {
      "correct": "Typical exertional chest pain relieved by rest indicates stable angina. ECG is the first step in evaluation.",
      "incorrect": [
        {"option": "Chest X-ray", "reason": "Used to assess heart size but not ischemia."},
        {"option": "Echocardiography", "reason": "Assesses structure, not ischemic pattern initially."},
        {"option": "Serum troponin", "reason": "Used for acute coronary syndrome, not stable angina."},
        {"option": "Cardiac catheterization", "reason": "Done after non-invasive testing confirms ischemia."}
      ]
    }
  },
  {
    "CaseID": "Emergency_109",
    "case": "A 36-year-old woman was brought to the ER complaining of sudden onset of difficult breathing. She had a significant smoking history and was suspected of having a pulmonary embolism. Which of the following is the gold standard test for this patient? [2/2024R]",
    "options": [
      "Pulmonary angiogram",
      "D-dimer",
      "CT pulmonary angiography",
      "V/Q scan",
      "Echocardiography"
    ],
    "correctAnswer": "Pulmonary angiogram",
    "explanation": {
      "correct": "Pulmonary angiography is the gold standard for diagnosis of pulmonary embolism, though CT angiography is now preferred practically.",
      "incorrect": [
        {"option": "D-dimer", "reason": "Used for screening, not confirmation."},
        {"option": "CT pulmonary angiography", "reason": "Highly accurate but not the historical gold standard."},
        {"option": "V/Q scan", "reason": "Alternative when CT contrast contraindicated."},
        {"option": "Echocardiography", "reason": "Detects right heart strain but not PE directly."}
      ]
    }
  },
  {
    "CaseID": "Emergency_110",
    "case": "You are working on a Friday night and several patients become symptomatic with vomiting and diarrhea. Which of the following actions should be taken? [2/2024R]",
    "options": [
      "Wait till Monday morning and then contact infection control",
      "No action is required; the day shift will sort it out",
      "Placing the patients on contact precautions, charting symptoms and following your facility’s procedure for reporting a suspected outbreak",
      "Ignore the situation and pretend you did not notice anything out of the ordinary"
    ],
    "correctAnswer": "Placing the patients on contact precautions, charting symptoms and following your facility’s procedure for reporting a suspected outbreak",
    "explanation": {
      "correct": "In suspected infectious outbreak, isolation and prompt reporting to infection control is mandatory to prevent spread.",
      "incorrect": [
        {"option": "Wait till Monday morning and then contact infection control", "reason": "Delays containment."},
        {"option": "No action is required; the day shift will sort it out", "reason": "Neglects infection control protocol."},
        {"option": "Ignore the situation", "reason": "Completely unsafe and unethical."}
      ]
    }
  },
  {
    "CaseID": "Emergency_111",
    "case": "A 3-year-old boy was brought to the ER in coma. His Glasgow coma scale was 6. He was playing at home unattended and became sleepy 3 hours ago. Examination revealed pin-point pupils. Which of the following is the most likely diagnosis? [2/2024R_8/2024R]",
    "options": [
      "Barbiturate intake",
      "Hypothermia",
      "Uncal herniation",
      "Severe hypoxia",
      "Post-ictal"
    ],
    "correctAnswer": "Barbiturate intake",
    "explanation": {
      "correct": "Coma with pinpoint pupils strongly suggests barbiturate or opioid toxicity; barbiturates are the most likely cause here.",
      "incorrect": [
        {"option": "Hypothermia", "reason": "Would present with bradycardia and shivering, not pinpoint pupils."},
        {"option": "Uncal herniation", "reason": "Causes dilated pupils due to CN III compression."},
        {"option": "Severe hypoxia", "reason": "Leads to cyanosis and bradycardia, not pinpoint pupils."},
        {"option": "Post-ictal", "reason": "Usually short-lived with normal pupils."}
      ]
    }
  },
  {
    "CaseID": "Emergency_112",
    "case": "A 9-month-old boy is brought to the ER because of increased agitation and restlessness. Lung examination reveals crackles and decreased breath sounds bilaterally. Chest x-ray shows bilateral pneumonia. ABG reveals O2 tension 45 mmHg and CO2 tension 60 mmHg. Which of the following is the most appropriate next step in management? [2/2024R_8/2024R]",
    "options": [
      "Obtaining blood cultures",
      "Administering oxygen",
      "Administering bronchodilators",
      "Administering antibiotics",
      "Inserting endotracheal tube"
    ],
    "correctAnswer": "Inserting endotracheal tube",
    "explanation": {
      "correct": "Severe respiratory failure (PaO2 45, PaCO2 60) requires airway protection and mechanical ventilation — immediate intubation.",
      "incorrect": [
        {"option": "Obtaining blood cultures", "reason": "Secondary step after stabilizing airway."},
        {"option": "Administering oxygen", "reason": "Insufficient in severe hypercapnia and hypoxia."},
        {"option": "Administering bronchodilators", "reason": "Not indicated for pneumonia."},
        {"option": "Administering antibiotics", "reason": "Necessary but after airway secured."}
      ]
    }
  },
  {
    "CaseID": "Emergency_113",
    "case": "A 22-year-old football player has been brought to the ER with severe left-sided chest pain following blunt injury sustained in a match about 2h ago. He is very tachypneic and there is extreme tenderness over the central part of his left hemithorax. The skin over the ribs looks badly bruised and the chest wall is unstable when he coughs or takes a deep breath. Which of the following is the most likely diagnosis? [8/2024R]",
    "options": [
      "Tension pneumothorax",
      "Cardiac tamponade",
      "Flail chest",
      "Open pneumothorax",
      "Massive hemothorax"
    ],
    "correctAnswer": "Flail chest",
    "explanation": {
      "correct": "Paradoxical chest wall movement with multiple rib fractures indicates flail chest — segment moves inward on inspiration, outward on expiration.",
      "incorrect": [
        {"option": "Tension pneumothorax", "reason": "Would show tracheal deviation and absent breath sounds."},
        {"option": "Cardiac tamponade", "reason": "Presents with muffled heart sounds and JVD, not rib tenderness."},
        {"option": "Open pneumothorax", "reason": "Causes sucking wound, not paradoxical motion."},
        {"option": "Massive hemothorax", "reason": "Leads to dullness and hypotension, not paradoxical movement."}
      ]
    }
  },
  {
    "CaseID": "Emergency_114",
    "case": "A 68-year-old man undergoes a robotic-assisted abdominal wall hernia repair and goes home the same day. Forty-eight hours later, he presents to ER generally ill with pyrexia. His white cell count is 18.5 x 10^9/L, and he has nonspecific abdominal pain and tenderness. Which of the following is the next appropriate step in his management? [8/2024R]",
    "options": [
      "Conservative treatment with IV fluids and observation",
      "Diagnostic laparotomy",
      "Diagnostic laparoscopy",
      "CT abdomen/pelvis with IV contrast",
      "Robotic-assisted exploration of the abdomen"
    ],
    "correctAnswer": "CT abdomen/pelvis with IV contrast",
    "explanation": {
      "correct": "Postoperative fever with abdominal pain requires CT with contrast to rule out abscess or anastomotic leak before invasive steps.",
      "incorrect": [
        {"option": "Conservative treatment with IV fluids and observation", "reason": "Inadequate; source must be identified."},
        {"option": "Diagnostic laparotomy", "reason": "Too invasive without imaging evidence."},
        {"option": "Diagnostic laparoscopy", "reason": "Considered after imaging confirms pathology."},
        {"option": "Robotic-assisted exploration of the abdomen", "reason": "Not appropriate for diagnostic evaluation."}
      ]
    }
  },
  {
    "CaseID": "Emergency_115",
    "case": "A 58-year-old smoker presented to the ER with severe heart failure with a main symptoms of dyspnea due to pulmonary congestion. Which of the following is the drug of choice in this case? [8/2024R]",
    "options": [
      "Digoxin",
      "Spironolactone",
      "furosemide",
      "Enalapril",
      "Ramipril"
    ],
    "correctAnswer": "furosemide",
    "explanation": {
      "correct": "Furosemide, a loop diuretic, rapidly relieves pulmonary congestion and dyspnea in acute decompensated heart failure by reducing preload.",
      "incorrect": [
        {"option": "Digoxin", "reason": "Improves contractility but acts slowly; not for acute relief of congestion."},
        {"option": "Spironolactone", "reason": "Used for chronic heart failure to prevent remodeling, not acute management."},
        {"option": "Enalapril", "reason": "ACE inhibitor for long-term therapy, contraindicated in acute pulmonary edema with hypotension."},
        {"option": "Ramipril", "reason": "Same as Enalapril — chronic use only."}
      ]
    }
  },
  {
    "CaseID": "Emergency_116",
    "case": "A 36-year-old female presents to the ED with a chief complaint of finger pain and swelling. She had previously been treated for an acute paronychia a few months ago, but states it 'won't go away.' Examination reveals a dystrophic nail, loss of the cuticle, as well as an area of tender, erythematous swelling along the proximal nail fold, without abscess formation. This chronic paronychia is best treated with which of the following? [1/2023M_2/2023T_2/2023R_6/2023S_6/2023R_8/2024R]",
    "options": [
      "Topical corticosteroids",
      "Oral antibiotics",
      "Oral antifungals",
      "Warm water soaks",
      "Oral antivirals"
    ],
    "correctAnswer": "Topical corticosteroids",
    "explanation": {
      "correct": "Chronic paronychia is inflammatory, not infectious — caused by irritants and loss of cuticle barrier. Topical corticosteroids reduce inflammation and promote healing.",
      "incorrect": [
        {"option": "Oral antibiotics", "reason": "Used for acute bacterial infections, not chronic inflammatory form."},
        {"option": "Oral antifungals", "reason": "Candida colonization is secondary, not the primary cause."},
        {"option": "Warm water soaks", "reason": "May help acutely but not definitive for chronic disease."},
        {"option": "Oral antivirals", "reason": "Not indicated unless herpetic whitlow suspected."}
      ]
    }
  },
  {
    "CaseID": "Emergency_117",
    "case": "Which of the following is the ideal infusion fluid for correction of hypokalemic alkalosis due to pyloric obstruction? [11/2020T_1/2023M_5/2023M_6/2023R_2/2024T_8/2024S]",
    "options": [
      "Normal saline",
      "Potassium chloride in 5% glucose",
      "Ringer’s solution",
      "Ammonium chloride",
      "Glucose-saline"
    ],
    "correctAnswer": "Potassium chloride in 5% glucose",
    "explanation": {
      "correct": "Hypokalemic metabolic alkalosis due to gastric losses should be corrected with potassium chloride in glucose solution to replace both potassium and chloride deficits.",
      "incorrect": [
        {"option": "Normal saline", "reason": "Corrects volume but not potassium loss."},
        {"option": "Ringer’s solution", "reason": "Contains minimal potassium; insufficient correction."},
        {"option": "Ammonium chloride", "reason": "Acidifying agent; rarely used due to toxicity risk."},
        {"option": "Glucose-saline", "reason": "Lacks potassium replacement."}
      ]
    }
  },
  {
    "CaseID": "Emergency_118",
    "case": "If you found a child in coma with pin pointed pupil what will you suspect? [1/2023M_2/2023T_2/2023R_6/2023S_6/2023R]",
    "options": [
      "Severe hypoxia",
      "Barbiturates intake",
      "Hypothermia",
      "Seizures",
      "Third n lesion"
    ],
    "correctAnswer": "Barbiturates intake",
    "explanation": {
      "correct": "Coma with pinpoint pupils suggests CNS depressant intoxication — barbiturate or opioid poisoning being most likely.",
      "incorrect": [
        {"option": "Severe hypoxia", "reason": "Causes dilated, unreactive pupils in late stages."},
        {"option": "Hypothermia", "reason": "Produces generalized depression but not pinpoint pupils."},
        {"option": "Seizures", "reason": "Postictal pupils are usually normal or dilated."},
        {"option": "Third n lesion", "reason": "Causes dilated, not constricted, pupils."}
      ]
    }
  },
  {
    "CaseID": "Emergency_119",
    "case": "A 65-year-old male presents with 2 hours of chest pain. He has ST elevations across his precordial leads and is diagnosed with an AMI. He is given thrombolytics in the ED. One hour after administration, he is still having chest pain and his BP is 80/60. The next best course of action would be [1/2023M_6/2023S]",
    "options": [
      "Dopamine infusion",
      "Nitroglycerin drip",
      "Placement of an aortic balloon pump",
      "Repeat thrombolytic administration",
      "Rescue PCI"
    ],
    "correctAnswer": "Rescue PCI",
    "explanation": {
      "correct": "Persistent pain and hypotension after thrombolysis indicate failed reperfusion. Immediate rescue PCI is indicated to restore coronary flow.",
      "incorrect": [
        {"option": "Dopamine infusion", "reason": "May support BP but does not treat the occlusion."},
        {"option": "Nitroglycerin drip", "reason": "Contraindicated in hypotension."},
        {"option": "Placement of an aortic balloon pump", "reason": "Adjunctive measure after PCI if cardiogenic shock persists."},
        {"option": "Repeat thrombolytic administration", "reason": "Not recommended due to bleeding risk and poor efficacy."}
      ]
    }
  },
  {
    "CaseID": "Emergency_120",
    "case": "A 27-year-old male is hammering nails at a construction site without eye protection and feels something strike his right eye. After washing out the eye, he still complains of pain and presents to the ED. Which of the following is the safest and most accurate modality for locating the potential foreign body? [12/2020T_5/2022M_2/2023R_8/2024R]",
    "options": [
      "X-ray",
      "Ultrasonography",
      "MRI",
      "CT scan",
      "Nuclear medicine scan"
    ],
    "correctAnswer": "CT scan",
    "explanation": {
      "correct": "CT scan accurately detects metallic intraocular foreign bodies and assesses globe integrity. MRI is contraindicated when metal is suspected.",
      "incorrect": [
        {"option": "X-ray", "reason": "May detect metal but lacks precision for localization."},
        {"option": "Ultrasonography", "reason": "Risky if globe rupture suspected."},
        {"option": "MRI", "reason": "Dangerous with metallic objects; may cause movement and injury."},
        {"option": "Nuclear medicine scan", "reason": "Irrelevant for foreign body detection."}
      ]
    }
  },
  {
    "CaseID": "Emergency_121",
    "case": "A 52-year-old male is brought to the ED after a high-speed motor vehicle crash. Airway: intact, breathing: normal, circulation: stable, disability: moves all extremities, exposure: ecchymosis to left upper chest. Vitals: HR 90, RR 22, BP 155/85, O2 sat 92%. Chest x-ray shows hemothorax on the left side. Which of the following is the next best step in management? [5/2022M_2/2023R_8/2024R]",
    "options": [
      "Left needle thoracostomy",
      "Left tube thoracostomy",
      "Right needle thoracostomy",
      "Right tube thoracostomy",
      "Supplemental oxygen"
    ],
    "correctAnswer": "Left tube thoracostomy",
    "explanation": {
      "correct": "Hemothorax requires immediate drainage via tube thoracostomy to evacuate blood and allow lung re-expansion.",
      "incorrect": [
        {"option": "Left needle thoracostomy", "reason": "Used for tension pneumothorax, not hemothorax."},
        {"option": "Right needle thoracostomy", "reason": "Wrong side and wrong indication."},
        {"option": "Right tube thoracostomy", "reason": "No pathology on the right side."},
        {"option": "Supplemental oxygen", "reason": "Supportive only, does not treat hemothorax."}
      ]
    }
  },
  {
    "CaseID": "Emergency_122",
    "case": "A 13-year-old boy arrives to the ED 3-hours after feeling a sudden left testicular pain while playing basketball. He had nausea and vomiting. On examination, a tender, swollen, high-riding testicle with absent cremasteric reflex. Which of the following should be the next step in management? [11/2023R_2/2024R_8/2024R]",
    "options": [
      "Color Doppler ultrasound",
      "Left orchiopexy",
      "Bilateral orchiopexy",
      "Scrotal support and rest",
      "Nonsteroidal anti-inflammatory drugs"
    ],
    "correctAnswer": "Bilateral orchiopexy",
    "explanation": {
      "correct": "Testicular torsion is a surgical emergency — immediate exploration and bilateral orchiopexy to fix both testes (contralateral at risk).",
      "incorrect": [
        {"option": "Color Doppler ultrasound", "reason": "Should not delay surgery when torsion is clinically evident."},
        {"option": "Left orchiopexy", "reason": "Both testes are fixed to prevent future torsion."},
        {"option": "Scrotal support and rest", "reason": "Inappropriate; irreversible ischemia may occur."},
        {"option": "Nonsteroidal anti-inflammatory drugs", "reason": "Only for pain, not definitive management."}
      ]
    }
  },
  {
    "CaseID": "Emergency_123",
    "case": "A 22-year-old male has accidentally caught fire in his kitchen. He has blistering and peeling of the skin on the front of upper chest, abdomen, and both upper limbs. Which is the single most likely total area involved? [8/2024S]",
    "options": [
      "0.09",
      "0.18",
      "0.27",
      "0.36",
      "0.45"
    ],
    "correctAnswer": "0.27",
    "explanation": {
      "correct": "According to the rule of nines: front of chest + abdomen (18%) + both upper limbs anteriorly (9%) = 27% total body surface area burned.",
      "incorrect": [
        {"option": "0.09", "reason": "Represents one limb only."},
        {"option": "0.18", "reason": "Covers only trunk front, not limbs."},
        {"option": "0.36", "reason": "Overestimates; includes posterior surfaces."},
        {"option": "0.45", "reason": "Represents nearly half the body — excessive for described burns."}
      ]
    }
  },
  {
    "CaseID": "Emergency_124",
    "case": "A 25 year-old male complains of substernal chest burning for several weeks which is related to eating. He denies fever, cough, or shortness of breath. He does not smoke, drink alcohol, drink caffeine, or take NSAIDs. His only medication is a pill for acne. Physical exam, chest x-ray, and ECG are normal. Which of the following is the most likely cause? [11/2022R]",
    "options": [
      "Atypical pneumonia",
      "Asthma",
      "Pericarditis",
      "Pill esophagitis",
      "Psychogenic"
    ],
    "correctAnswer": "Pill esophagitis",
    "explanation": {
      "correct": "Retrosternal burning after taking medications like tetracycline or isotretinoin for acne suggests pill-induced esophagitis due to mucosal irritation.",
      "incorrect": [
        {"option": "Atypical pneumonia", "reason": "Presents with fever and cough."},
        {"option": "Asthma", "reason": "Causes wheezing and dyspnea, not chest burning."},
        {"option": "Pericarditis", "reason": "Produces sharp pleuritic pain, not food-related."},
        {"option": "Psychogenic", "reason": "Diagnosis of exclusion; symptoms have clear physical cause here."}
      ]
    }
  },
  {
    "CaseID": "Emergency_125",
    "case": "Which of the following is the best guide to fluid replacement in a burns patient? [11/2020T_1/2021T_11/2022R]",
    "options": [
      "Hemoglobin and hematocrit",
      "Urine output",
      "Urine osmolality",
      "Plasma volume",
      "Specific gravity"
    ],
    "correctAnswer": "Urine output",
    "explanation": {
      "correct": "Urine output (0.5–1 mL/kg/hr in adults) is the best indicator of adequate fluid replacement in burns patients.",
      "incorrect": [
        {"option": "Hemoglobin and hematocrit", "reason": "May be affected by hemoconcentration or bleeding."},
        {"option": "Urine osmolality", "reason": "Not routinely measured in emergency settings."},
        {"option": "Plasma volume", "reason": "Difficult to monitor directly."},
        {"option": "Specific gravity", "reason": "Less accurate for ongoing monitoring."}
      ]
    }
  },
  {
    "CaseID": "Emergency_126",
    "case": "A 35-year-old firefighter is admitted from a house fire with 50% third-degree burns. His weight is estimated at 80 kg. How much fluid should be administered to him in the first 8 hours? [11/2020T_5/2022M_11/2023T]",
    "options": [
      "5 L",
      "6 L",
      "8 L",
      "14 L",
      "16 L"
    ],
    "correctAnswer": "8 L",
    "explanation": {
      "correct": "Using Parkland formula: 4 mL × 80 kg × 50% = 16,000 mL (16 L total in 24h). Half (8 L) should be given in the first 8 hours.",
      "incorrect": [
        {"option": "5 L", "reason": "Underestimates required fluids, risking hypovolemia."},
        {"option": "6 L", "reason": "Still below calculated requirement."},
        {"option": "14 L", "reason": "Represents nearly full 24-hour volume."},
        {"option": "16 L", "reason": "Total amount for full 24 hours, not initial 8 hours."}
      ]
    }
  },
  {
    "CaseID": "Emergency_127",
    "case": "A 35-year-old 80-kg man was transported to the regional burn center at the hospital after suffering second- and third-degree burns. On arrival, he is found to have burns across his face, anterior neck, chest, and anterior abdomen, as well as bilateral circumferential upper extremity burns. Which of the following is the estimation of the total body surface area (TBSA) of his burn? [2/2024R]",
    "options": [
      "0.3",
      "0.35",
      "0.4",
      "0.5",
      "0.6"
    ],
    "correctAnswer": "0.4",
    "explanation": {
      "correct": "Using the rule of nines: head and neck (9%), anterior trunk (18%), and both upper limbs (18%) — total ≈ 45%, rounded to 40% (0.4).",
      "incorrect": [
        {"option": "0.3", "reason": "Underestimates burn area; excludes limbs."},
        {"option": "0.35", "reason": "Slightly low for described regions."},
        {"option": "0.5", "reason": "Overestimates; posterior areas not involved."},
        {"option": "0.6", "reason": "Far exceeds described anterior involvement."}
      ]
    }
  },
  {
    "CaseID": "Emergency_128",
    "case": "A 70-kg mechanical engineer sustains a mixture of partial and full thickness burns to his lower limbs (<5% BSA, full-thickness) from a fractured pipe leaking pressurized steam. You calculate that he has 14% BSA total burns. What is the appropriate fluid management? [5/2022M_8/2024R]",
    "options": [
      "0.5-1 litres Ringer lactate solution in 8 h",
      "0.5-1 litres Ringer lactate solution in 8 h, transfer to burns unit",
      "1-2 litres Ringer lactate solution in 8 h",
      "1-2 litres Ringer lactate solution in 8 h, transfer to burns unit",
      "2-4 litres Ringer lactate solution in 8 h"
    ],
    "correctAnswer": "1-2 litres Ringer lactate solution in 8 h, transfer to burns unit",
    "explanation": {
      "correct": "For burns <15% TBSA, initial fluid resuscitation with 1–2 L Ringer’s lactate is sufficient, followed by referral to a burn center for ongoing care.",
      "incorrect": [
        {"option": "0.5-1 litres Ringer lactate solution in 8 h", "reason": "Insufficient for 14% BSA burns."},
        {"option": "0.5-1 litres Ringer lactate solution in 8 h, transfer to burns unit", "reason": "Fluids inadequate for this burn extent."},
        {"option": "1-2 litres Ringer lactate solution in 8 h", "reason": "Appropriate volume but must include transfer for specialized care."},
        {"option": "2-4 litres Ringer lactate solution in 8 h", "reason": "Excessive for mild to moderate burns."}
      ]
    }
  },
  {
    "CaseID": "Emergency_129",
    "case": "A 72-year-old woman presents to the ED with acute left lower quadrant abdominal pain. Her past medical history is significant only for mild hypertension. On exam, she is febrile to 38.2°C with focal rebound tenderness in her left lower quadrant. She has a WBC of 12000 /mm3. Abdominal CT imaging reveals a thickened sigmoid with a 3.0 cm × 3.0 cm peri-sigmoid colon abscess with a very small pocket of extra-luminal air in the pelvis, which of the following is the next step in management? [11/2022R_1/2023M_5/2023M_6/2023R_11/2023T_2/2024T_2/2024S_8/2024S]",
    "options": [
      "Exploration, sigmoidectomy with descending end colostomy (Hartmann's procedure)",
      "Exploration with sigmoidectomy, primary colorectal anastomosis",
      "Exploration with sigmoidectomy, primary colorectal anastomosis, and loop ileostomy",
      "Resuscitation, broad spectrum IV antibiotics and percutaneous drainage of the abscess",
      "Resuscitation, broad spectrum IV antibiotics, colonoscopy for likely colon carcinoma on this admission"
    ],
    "correctAnswer": "Resuscitation, broad spectrum IV antibiotics and percutaneous drainage of the abscess",
    "explanation": {
      "correct": "Localized diverticular abscess with minimal free air should be managed non-operatively with IV antibiotics and image-guided percutaneous drainage.",
      "incorrect": [
        {"option": "Exploration, sigmoidectomy with descending end colostomy (Hartmann's procedure)", "reason": "Reserved for diffuse peritonitis or large perforation."},
        {"option": "Exploration with sigmoidectomy, primary colorectal anastomosis", "reason": "Not indicated in localized abscess."},
        {"option": "Exploration with sigmoidectomy, primary colorectal anastomosis, and loop ileostomy", "reason": "Too aggressive for contained abscess."},
        {"option": "Resuscitation, broad spectrum IV antibiotics, colonoscopy for likely colon carcinoma on this admission", "reason": "Colonoscopy contraindicated during acute inflammation."}
      ]
    }
  },
  {
    "CaseID": "Emergency_130",
    "case": "A 15-year-old male is brought to the ED after being submerged in a lake for 'a minute or two.' He had been water skiing when he lost control and 'wiped out' and then was lying face down in the water without moving. He was not breathing when his friends pulled him out, but he regained spontaneous respirations after CPR. In the ED, he is awake, somnolent, and breathing spontaneously with a pulse oximetry of 95% on room air. What is the next most important step in management? [5/2022M_8/2024R]",
    "options": [
      "IV antibiotics",
      "Rapid sequence intubation",
      "IV dexamethasone",
      "Cervical spine imaging",
      "ED thoracotomy"
    ],
    "correctAnswer": "Cervical spine imaging",
    "explanation": {
      "correct": "In near-drowning victims, cervical spine injury must be excluded due to the mechanism of trauma during submersion or impact.",
      "incorrect": [
        {"option": "IV antibiotics", "reason": "Not routinely indicated unless aspiration pneumonia develops."},
        {"option": "Rapid sequence intubation", "reason": "Unnecessary as patient is breathing adequately."},
        {"option": "IV dexamethasone", "reason": "No evidence of benefit in drowning or CNS protection."},
        {"option": "ED thoracotomy", "reason": "Not indicated unless cardiac arrest with penetrating trauma."}
      ]
    }
  },
  {
    "CaseID": "Emergency_131",
    "case": "An 18-year-old motorcyclist is brought in after being thrown off his bike. He is confused and there is evidence of blood and vomit around his mouth. Vital signs: BP 130/55 mmHg, pulse 110/min, RR 28/min. What is the appropriate resuscitation measure with highest priority for this patient? [5/2022M_2/2023R_6/2023S_8/2024R]",
    "options": [
      "Airway management",
      "Chest drain",
      "Chest X-ray",
      "Cross-match and blood transfusion",
      "Urgent neurological opinion"
    ],
    "correctAnswer": "Airway management",
    "explanation": {
      "correct": "The airway is always the first priority in trauma, especially in a confused patient with blood and vomit posing risk of aspiration.",
      "incorrect": [
        {"option": "Chest drain", "reason": "Addressed after airway and breathing are secured."},
        {"option": "Chest X-ray", "reason": "Performed after stabilization."},
        {"option": "Cross-match and blood transfusion", "reason": "Secondary to airway and breathing stabilization."},
        {"option": "Urgent neurological opinion", "reason": "Not part of initial resuscitation priorities (A–B–C)."}
      ]
    }
  },
  {
    "CaseID": "Emergency_132",
    "case": "When approaching a collapsed victim in the out of hospital setting, after assessing the level of responsiveness. What is the next step should be done? [5/2022M_8/2024R]",
    "options": [
      "Administer ventilations",
      "Call for help",
      "Initiate an intravenous (IV)",
      "Stabilize the cervical spine",
      "Start chest compressions"
    ],
    "correctAnswer": "Call for help",
    "explanation": {
      "correct": "After confirming unresponsiveness, the rescuer should immediately call for help or activate emergency services before proceeding to airway and CPR steps.",
      "incorrect": [
        {"option": "Administer ventilations", "reason": "Done later in CPR sequence after help is called."},
        {"option": "Initiate an intravenous (IV)", "reason": "Not part of the initial response sequence."},
        {"option": "Stabilize the cervical spine", "reason": "Only if trauma suspected, after help is summoned."},
        {"option": "Start chest compressions", "reason": "Done after confirming cardiac arrest and calling for help."}
      ]
    }
  }
]
